MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1615/mcu.h
// Register: CRCXOR
#define CRCXOR CRCXOR
extern volatile unsigned short          CRCXOR              __at(0x797);
#ifndef _LIB_BUILD
asm("CRCXOR equ 0797h");
#endif

// Register: CRCXORL
#define CRCXORL CRCXORL
extern volatile unsigned char           CRCXORL             __at(0x797);
#ifndef _LIB_BUILD
asm("CRCXORL equ 0797h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned XOR1                   :1;
        unsigned XOR2                   :1;
        unsigned XOR3                   :1;
        unsigned XOR4                   :1;
        unsigned XOR5                   :1;
        unsigned XOR6                   :1;
        unsigned XOR7                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned CRCXOR1                :1;
        unsigned CRCXOR2                :1;
        unsigned CRCXOR3                :1;
        unsigned CRCXOR4                :1;
        unsigned CRCXOR5                :1;
        unsigned CRCXOR6                :1;
        unsigned CRCXOR7                :1;
    };
} CRCXORLbits_t;
extern volatile CRCXORLbits_t CRCXORLbits __at(0x797);
// bitfield macros
#define _CRCXORL_XOR1_POSN                                  0x1
#define _CRCXORL_XOR1_POSITION                              0x1
#define _CRCXORL_XOR1_SIZE                                  0x1
#define _CRCXORL_XOR1_LENGTH                                0x1
#define _CRCXORL_XOR1_MASK                                  0x2
#define _CRCXORL_XOR2_POSN                                  0x2
#define _CRCXORL_XOR2_POSITION                              0x2
#define _CRCXORL_XOR2_SIZE                                  0x1
#define _CRCXORL_XOR2_LENGTH                                0x1
#define _CRCXORL_XOR2_MASK                                  0x4
#define _CRCXORL_XOR3_POSN                                  0x3
#define _CRCXORL_XOR3_POSITION                              0x3
#define _CRCXORL_XOR3_SIZE                                  0x1
#define _CRCXORL_XOR3_LENGTH                                0x1
#define _CRCXORL_XOR3_MASK                                  0x8
#define _CRCXORL_XOR4_POSN                                  0x4
#define _CRCXORL_XOR4_POSITION                              0x4
#define _CRCXORL_XOR4_SIZE                                  0x1
#define _CRCXORL_XOR4_LENGTH                                0x1
#define _CRCXORL_XOR4_MASK                                  0x10
#define _CRCXORL_XOR5_POSN                                  0x5
#define _CRCXORL_XOR5_POSITION                              0x5
#define _CRCXORL_XOR5_SIZE                                  0x1
#define _CRCXORL_XOR5_LENGTH                                0x1
#define _CRCXORL_XOR5_MASK                                  0x20
#define _CRCXORL_XOR6_POSN                                  0x6
#define _CRCXORL_XOR6_POSITION                              0x6
#define _CRCXORL_XOR6_SIZE                                  0x1
#define _CRCXORL_XOR6_LENGTH                                0x1
#define _CRCXORL_XOR6_MASK                                  0x40
#define _CRCXORL_XOR7_POSN                                  0x7
#define _CRCXORL_XOR7_POSITION                              0x7
#define _CRCXORL_XOR7_SIZE                                  0x1
#define _CRCXORL_XOR7_LENGTH                                0x1
#define _CRCXORL_XOR7_MASK                                  0x80
#define _CRCXORL_CRCXOR1_POSN                               0x1
#define _CRCXORL_CRCXOR1_POSITION                           0x1
#define _CRCXORL_CRCXOR1_SIZE                               0x1
#define _CRCXORL_CRCXOR1_LENGTH                             0x1
#define _CRCXORL_CRCXOR1_MASK                               0x2
#define _CRCXORL_CRCXOR2_POSN                               0x2
#define _CRCXORL_CRCXOR2_POSITION                           0x2
#define _CRCXORL_CRCXOR2_SIZE                               0x1
#define _CRCXORL_CRCXOR2_LENGTH                             0x1
#define _CRCXORL_CRCXOR2_MASK                               0x4
#define _CRCXORL_CRCXOR3_POSN                               0x3
#define _CRCXORL_CRCXOR3_POSITION                           0x3
#define _CRCXORL_CRCXOR3_SIZE                               0x1
#define _CRCXORL_CRCXOR3_LENGTH                             0x1
#define _CRCXORL_CRCXOR3_MASK                               0x8
#define _CRCXORL_CRCXOR4_POSN                               0x4
#define _CRCXORL_CRCXOR4_POSITION                           0x4
#define _CRCXORL_CRCXOR4_SIZE                               0x1
#define _CRCXORL_CRCXOR4_LENGTH                             0x1
#define _CRCXORL_CRCXOR4_MASK                               0x10
#define _CRCXORL_CRCXOR5_POSN                               0x5
#define _CRCXORL_CRCXOR5_POSITION                           0x5
#define _CRCXORL_CRCXOR5_SIZE                               0x1
#define _CRCXORL_CRCXOR5_LENGTH                             0x1
#define _CRCXORL_CRCXOR5_MASK                               0x20
#define _CRCXORL_CRCXOR6_POSN                               0x6
#define _CRCXORL_CRCXOR6_POSITION                           0x6
#define _CRCXORL_CRCXOR6_SIZE                               0x1
#define _CRCXORL_CRCXOR6_LENGTH                             0x1
#define _CRCXORL_CRCXOR6_MASK                               0x40
#define _CRCXORL_CRCXOR7_POSN                               0x7
#define _CRCXORL_CRCXOR7_POSITION                           0x7
#define _CRCXORL_CRCXOR7_SIZE                               0x1
#define _CRCXORL_CRCXOR7_LENGTH                             0x1
#define _CRCXORL_CRCXOR7_MASK                               0x80

// Register: CRCXORH
#define CRCXORH CRCXORH
extern volatile unsigned char           CRCXORH             __at(0x798);
#ifndef _LIB_BUILD
asm("CRCXORH equ 0798h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XOR8                   :1;
        unsigned XOR9                   :1;
        unsigned XOR10                  :1;
        unsigned XOR11                  :1;
        unsigned XOR12                  :1;
        unsigned XOR13                  :1;
        unsigned XOR14                  :1;
        unsigned XOR15                  :1;
    };
    struct {
        unsigned CRCXOR8                :1;
        unsigned CRCXOR9                :1;
        unsigned CRCXOR10               :1;
        unsigned CRCXOR11               :1;
        unsigned CRCXOR12               :1;
        unsigned CRCXOR13               :1;
        unsigned CRCXOR14               :1;
        unsigned CRCXOR15               :1;
    };
} CRCXORHbits_t;
extern volatile CRCXORHbits_t CRCXORHbits __at(0x798);
// bitfield macros
#define _CRCXORH_XOR8_POSN                                  0x0
#define _CRCXORH_XOR8_POSITION                              0x0
#define _CRCXORH_XOR8_SIZE                                  0x1
#define _CRCXORH_XOR8_LENGTH                                0x1
#define _CRCXORH_XOR8_MASK                                  0x1
#define _CRCXORH_XOR9_POSN                                  0x1
#define _CRCXORH_XOR9_POSITION                              0x1
#define _CRCXORH_XOR9_SIZE                                  0x1
#define _CRCXORH_XOR9_LENGTH                                0x1
#define _CRCXORH_XOR9_MASK                                  0x2
#define _CRCXORH_XOR10_POSN                                 0x2
#define _CRCXORH_XOR10_POSITION                             0x2
#define _CRCXORH_XOR10_SIZE                                 0x1
#define _CRCXORH_XOR10_LENGTH                               0x1
#define _CRCXORH_XOR10_MASK                                 0x4
#define _CRCXORH_XOR11_POSN                                 0x3
#define _CRCXORH_XOR11_POSITION                             0x3
#define _CRCXORH_XOR11_SIZE                                 0x1
#define _CRCXORH_XOR11_LENGTH                               0x1
#define _CRCXORH_XOR11_MASK                                 0x8
#define _CRCXORH_XOR12_POSN                                 0x4
#define _CRCXORH_XOR12_POSITION                             0x4
#define _CRCXORH_XOR12_SIZE                                 0x1
#define _CRCXORH_XOR12_LENGTH                               0x1
#define _CRCXORH_XOR12_MASK                                 0x10
#define _CRCXORH_XOR13_POSN                                 0x5
#define _CRCXORH_XOR13_POSITION                             0x5
#define _CRCXORH_XOR13_SIZE                                 0x1
#define _CRCXORH_XOR13_LENGTH                               0x1
#define _CRCXORH_XOR13_MASK                                 0x20
#define _CRCXORH_XOR14_POSN                                 0x6
#define _CRCXORH_XOR14_POSITION                             0x6
#define _CRCXORH_XOR14_SIZE                                 0x1
#define _CRCXORH_XOR14_LENGTH                               0x1
#define _CRCXORH_XOR14_MASK                                 0x40
#define _CRCXORH_XOR15_POSN                                 0x7
#define _CRCXORH_XOR15_POSITION                             0x7
#define _CRCXORH_XOR15_SIZE                                 0x1
#define _CRCXORH_XOR15_LENGTH                               0x1
#define _CRCXORH_XOR15_MASK                                 0x80
#define _CRCXORH_CRCXOR8_POSN                               0x0
#define _CRCXORH_CRCXOR8_POSITION                           0x0
#define _CRCXORH_CRCXOR8_SIZE                               0x1
#define _CRCXORH_CRCXOR8_LENGTH                             0x1
#define _CRCXORH_CRCXOR8_MASK                               0x1
#define _CRCXORH_CRCXOR9_POSN                               0x1
#define _CRCXORH_CRCXOR9_POSITION                           0x1
#define _CRCXORH_CRCXOR9_SIZE                               0x1
#define _CRCXORH_CRCXOR9_LENGTH                             0x1
#define _CRCXORH_CRCXOR9_MASK                               0x2
#define _CRCXORH_CRCXOR10_POSN                              0x2
#define _CRCXORH_CRCXOR10_POSITION                          0x2
#define _CRCXORH_CRCXOR10_SIZE                              0x1
#define _CRCXORH_CRCXOR10_LENGTH                            0x1
#define _CRCXORH_CRCXOR10_MASK                              0x4
#define _CRCXORH_CRCXOR11_POSN                              0x3
#define _CRCXORH_CRCXOR11_POSITION                          0x3
#define _CRCXORH_CRCXOR11_SIZE                              0x1
#define _CRCXORH_CRCXOR11_LENGTH                            0x1
#define _CRCXORH_CRCXOR11_MASK                              0x8
#define _CRCXORH_CRCXOR12_POSN                              0x4
#define _CRCXORH_CRCXOR12_POSITION                          0x4
#define _CRCXORH_CRCXOR12_SIZE                              0x1
#define _CRCXORH_CRCXOR12_LENGTH                            0x1
#define _CRCXORH_CRCXOR12_MASK                              0x10
#define _CRCXORH_CRCXOR13_POSN                              0x5
#define _CRCXORH_CRCXOR13_POSITION                          0x5
#define _CRCXORH_CRCXOR13_SIZE                              0x1
#define _CRCXORH_CRCXOR13_LENGTH                            0x1
#define _CRCXORH_CRCXOR13_MASK                              0x20
#define _CRCXORH_CRCXOR14_POSN                              0x6
#define _CRCXORH_CRCXOR14_POSITION                          0x6
#define _CRCXORH_CRCXOR14_SIZE                              0x1
#define _CRCXORH_CRCXOR14_LENGTH                            0x1
#define _CRCXORH_CRCXOR14_MASK                              0x40
#define _CRCXORH_CRCXOR15_POSN                              0x7
#define _CRCXORH_CRCXOR15_POSITION                          0x7
#define _CRCXORH_CRCXOR15_SIZE                              0x1
#define _CRCXORH_CRCXOR15_LENGTH                            0x1
#define _CRCXORH_CRCXOR15_MASK                              0x80

// Register: CRCCON0
#define CRCCON0 CRCCON0
extern volatile unsigned char           CRCCON0             __at(0x799);
#ifndef _LIB_BUILD
asm("CRCCON0 equ 0799h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FULL                   :1;
        unsigned SHIFTM                 :1;
        unsigned                        :2;
        unsigned ACCM                   :1;
        unsigned BUSY                   :1;
        unsigned CRCGO                  :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned CRCFULL                :1;
        unsigned CRCSHIFTM              :1;
        unsigned                        :2;
        unsigned CRCACCM                :1;
        unsigned CRCBUSY                :1;
        unsigned                        :1;
        unsigned CRCEN                  :1;
    };
} CRCCON0bits_t;
extern volatile CRCCON0bits_t CRCCON0bits __at(0x799);
// bitfield macros
#define _CRCCON0_FULL_POSN                                  0x0
#define _CRCCON0_FULL_POSITION                              0x0
#define _CRCCON0_FULL_SIZE                                  0x1
#define _CRCCON0_FULL_LENGTH                                0x1
#define _CRCCON0_FULL_MASK                                  0x1
#define _CRCCON0_SHIFTM_POSN                                0x1
#define _CRCCON0_SHIFTM_POSITION                            0x1
#define _CRCCON0_SHIFTM_SIZE                                0x1
#define _CRCCON0_SHIFTM_LENGTH                              0x1
#define _CRCCON0_SHIFTM_MASK                                0x2
#define _CRCCON0_ACCM_POSN                                  0x4
#define _CRCCON0_ACCM_POSITION                              0x4
#define _CRCCON0_ACCM_SIZE                                  0x1
#define _CRCCON0_ACCM_LENGTH                                0x1
#define _CRCCON0_ACCM_MASK                                  0x10
#define _CRCCON0_BUSY_POSN                                  0x5
#define _CRCCON0_BUSY_POSITION                              0x5
#define _CRCCON0_BUSY_SIZE                                  0x1
#define _CRCCON0_BUSY_LENGTH                                0x1
#define _CRCCON0_BUSY_MASK                                  0x20
#define _CRCCON0_CRCGO_POSN                                 0x6
#define _CRCCON0_CRCGO_POSITION                             0x6
#define _CRCCON0_CRCGO_SIZE                                 0x1
#define _CRCCON0_CRCGO_LENGTH                               0x1
#define _CRCCON0_CRCGO_MASK                                 0x40
#define _CRCCON0_EN_POSN                                    0x7
#define _CRCCON0_EN_POSITION                                0x7
#define _CRCCON0_EN_SIZE                                    0x1
#define _CRCCON0_EN_LENGTH                                  0x1
#define _CRCCON0_EN_MASK                                    0x80
#define _CRCCON0_CRCFULL_POSN                               0x0
#define _CRCCON0_CRCFULL_POSITION                           0x0
#define _CRCCON0_CRCFULL_SIZE                               0x1
#define _CRCCON0_CRCFULL_LENGTH                             0x1
#define _CRCCON0_CRCFULL_MASK                               0x1
#define _CRCCON0_CRCSHIFTM_POSN                             0x1
#define _CRCCON0_CRCSHIFTM_POSITION                         0x1
#define _CRCCON0_CRCSHIFTM_SIZE                             0x1
#define _CRCCON0_CRCSHIFTM_LENGTH                           0x1
#define _CRCCON0_CRCSHIFTM_MASK                             0x2
#define _CRCCON0_CRCACCM_POSN                               0x4
#define _CRCCON0_CRCACCM_POSITION                           0x4
#define _CRCCON0_CRCACCM_SIZE                               0x1
#define _CRCCON0_CRCACCM_LENGTH                             0x1
#define _CRCCON0_CRCACCM_MASK                               0x10
#define _CRCCON0_CRCBUSY_POSN                               0x5
#define _CRCCON0_CRCBUSY_POSITION                           0x5
#define _CRCCON0_CRCBUSY_SIZE                               0x1
#define _CRCCON0_CRCBUSY_LENGTH                             0x1
#define _CRCCON0_CRCBUSY_MASK                               0x20
#define _CRCCON0_CRCEN_POSN                                 0x7
#define _CRCCON0_CRCEN_POSITION                             0x7
#define _CRCCON0_CRCEN_SIZE                                 0x1
#define _CRCCON0_CRCEN_LENGTH                               0x1
#define _CRCCON0_CRCEN_MASK                                 0x80

