MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1615/mcu.h
extern volatile AT1PHSLbits_t AT1PHSLbits __at(0x812);
// bitfield macros
#define _AT1PHSL_AT1PHS0_POSN                               0x0
#define _AT1PHSL_AT1PHS0_POSITION                           0x0
#define _AT1PHSL_AT1PHS0_SIZE                               0x1
#define _AT1PHSL_AT1PHS0_LENGTH                             0x1
#define _AT1PHSL_AT1PHS0_MASK                               0x1
#define _AT1PHSL_AT1PHS1_POSN                               0x1
#define _AT1PHSL_AT1PHS1_POSITION                           0x1
#define _AT1PHSL_AT1PHS1_SIZE                               0x1
#define _AT1PHSL_AT1PHS1_LENGTH                             0x1
#define _AT1PHSL_AT1PHS1_MASK                               0x2
#define _AT1PHSL_AT1PHS2_POSN                               0x2
#define _AT1PHSL_AT1PHS2_POSITION                           0x2
#define _AT1PHSL_AT1PHS2_SIZE                               0x1
#define _AT1PHSL_AT1PHS2_LENGTH                             0x1
#define _AT1PHSL_AT1PHS2_MASK                               0x4
#define _AT1PHSL_AT1PHS3_POSN                               0x3
#define _AT1PHSL_AT1PHS3_POSITION                           0x3
#define _AT1PHSL_AT1PHS3_SIZE                               0x1
#define _AT1PHSL_AT1PHS3_LENGTH                             0x1
#define _AT1PHSL_AT1PHS3_MASK                               0x8
#define _AT1PHSL_AT1PHS4_POSN                               0x4
#define _AT1PHSL_AT1PHS4_POSITION                           0x4
#define _AT1PHSL_AT1PHS4_SIZE                               0x1
#define _AT1PHSL_AT1PHS4_LENGTH                             0x1
#define _AT1PHSL_AT1PHS4_MASK                               0x10
#define _AT1PHSL_AT1PHS5_POSN                               0x5
#define _AT1PHSL_AT1PHS5_POSITION                           0x5
#define _AT1PHSL_AT1PHS5_SIZE                               0x1
#define _AT1PHSL_AT1PHS5_LENGTH                             0x1
#define _AT1PHSL_AT1PHS5_MASK                               0x20
#define _AT1PHSL_AT1PHS6_POSN                               0x6
#define _AT1PHSL_AT1PHS6_POSITION                           0x6
#define _AT1PHSL_AT1PHS6_SIZE                               0x1
#define _AT1PHSL_AT1PHS6_LENGTH                             0x1
#define _AT1PHSL_AT1PHS6_MASK                               0x40
#define _AT1PHSL_AT1PHS7_POSN                               0x7
#define _AT1PHSL_AT1PHS7_POSITION                           0x7
#define _AT1PHSL_AT1PHS7_SIZE                               0x1
#define _AT1PHSL_AT1PHS7_LENGTH                             0x1
#define _AT1PHSL_AT1PHS7_MASK                               0x80
#define _AT1PHSL_PHS0_POSN                                  0x0
#define _AT1PHSL_PHS0_POSITION                              0x0
#define _AT1PHSL_PHS0_SIZE                                  0x1
#define _AT1PHSL_PHS0_LENGTH                                0x1
#define _AT1PHSL_PHS0_MASK                                  0x1
#define _AT1PHSL_PHS1_POSN                                  0x1
#define _AT1PHSL_PHS1_POSITION                              0x1
#define _AT1PHSL_PHS1_SIZE                                  0x1
#define _AT1PHSL_PHS1_LENGTH                                0x1
#define _AT1PHSL_PHS1_MASK                                  0x2
#define _AT1PHSL_PHS2_POSN                                  0x2
#define _AT1PHSL_PHS2_POSITION                              0x2
#define _AT1PHSL_PHS2_SIZE                                  0x1
#define _AT1PHSL_PHS2_LENGTH                                0x1
#define _AT1PHSL_PHS2_MASK                                  0x4
#define _AT1PHSL_PHS3_POSN                                  0x3
#define _AT1PHSL_PHS3_POSITION                              0x3
#define _AT1PHSL_PHS3_SIZE                                  0x1
#define _AT1PHSL_PHS3_LENGTH                                0x1
#define _AT1PHSL_PHS3_MASK                                  0x8
#define _AT1PHSL_PHS4_POSN                                  0x4
#define _AT1PHSL_PHS4_POSITION                              0x4
#define _AT1PHSL_PHS4_SIZE                                  0x1
#define _AT1PHSL_PHS4_LENGTH                                0x1
#define _AT1PHSL_PHS4_MASK                                  0x10
#define _AT1PHSL_PHS5_POSN                                  0x5
#define _AT1PHSL_PHS5_POSITION                              0x5
#define _AT1PHSL_PHS5_SIZE                                  0x1
#define _AT1PHSL_PHS5_LENGTH                                0x1
#define _AT1PHSL_PHS5_MASK                                  0x20
#define _AT1PHSL_PHS6_POSN                                  0x6
#define _AT1PHSL_PHS6_POSITION                              0x6
#define _AT1PHSL_PHS6_SIZE                                  0x1
#define _AT1PHSL_PHS6_LENGTH                                0x1
#define _AT1PHSL_PHS6_MASK                                  0x40
#define _AT1PHSL_PHS7_POSN                                  0x7
#define _AT1PHSL_PHS7_POSITION                              0x7
#define _AT1PHSL_PHS7_SIZE                                  0x1
#define _AT1PHSL_PHS7_LENGTH                                0x1
#define _AT1PHSL_PHS7_MASK                                  0x80

// Register: AT1PHSH
#define AT1PHSH AT1PHSH
extern volatile unsigned char           AT1PHSH             __at(0x813);
#ifndef _LIB_BUILD
asm("AT1PHSH equ 0813h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1PHS8                :1;
        unsigned AT1PHS9                :1;
    };
    struct {
        unsigned PHS8                   :1;
        unsigned PHS9                   :1;
    };
    struct {
        unsigned PHSL8                  :1;
        unsigned PHSL9                  :1;
    };
} AT1PHSHbits_t;
extern volatile AT1PHSHbits_t AT1PHSHbits __at(0x813);
// bitfield macros
#define _AT1PHSH_AT1PHS8_POSN                               0x0
#define _AT1PHSH_AT1PHS8_POSITION                           0x0
#define _AT1PHSH_AT1PHS8_SIZE                               0x1
#define _AT1PHSH_AT1PHS8_LENGTH                             0x1
#define _AT1PHSH_AT1PHS8_MASK                               0x1
#define _AT1PHSH_AT1PHS9_POSN                               0x1
#define _AT1PHSH_AT1PHS9_POSITION                           0x1
#define _AT1PHSH_AT1PHS9_SIZE                               0x1
#define _AT1PHSH_AT1PHS9_LENGTH                             0x1
#define _AT1PHSH_AT1PHS9_MASK                               0x2
#define _AT1PHSH_PHS8_POSN                                  0x0
#define _AT1PHSH_PHS8_POSITION                              0x0
#define _AT1PHSH_PHS8_SIZE                                  0x1
#define _AT1PHSH_PHS8_LENGTH                                0x1
#define _AT1PHSH_PHS8_MASK                                  0x1
#define _AT1PHSH_PHS9_POSN                                  0x1
#define _AT1PHSH_PHS9_POSITION                              0x1
#define _AT1PHSH_PHS9_SIZE                                  0x1
#define _AT1PHSH_PHS9_LENGTH                                0x1
#define _AT1PHSH_PHS9_MASK                                  0x2
#define _AT1PHSH_PHSL8_POSN                                 0x0
#define _AT1PHSH_PHSL8_POSITION                             0x0
#define _AT1PHSH_PHSL8_SIZE                                 0x1
#define _AT1PHSH_PHSL8_LENGTH                               0x1
#define _AT1PHSH_PHSL8_MASK                                 0x1
#define _AT1PHSH_PHSL9_POSN                                 0x1
#define _AT1PHSH_PHSL9_POSITION                             0x1
#define _AT1PHSH_PHSL9_SIZE                                 0x1
#define _AT1PHSH_PHSL9_LENGTH                               0x1
#define _AT1PHSH_PHSL9_MASK                                 0x2

// Register: AT1CON0
#define AT1CON0 AT1CON0
extern volatile unsigned char           AT1CON0             __at(0x814);
#ifndef _LIB_BUILD
asm("AT1CON0 equ 0814h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :1;
        unsigned APMOD                  :1;
        unsigned                        :1;
        unsigned POL                    :1;
        unsigned PS                     :2;
        unsigned PREC                   :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
    };
    struct {
        unsigned AT1MODE                :1;
        unsigned AT1APMOD               :1;
        unsigned                        :1;
        unsigned AT1POL                 :1;
        unsigned AT1PS                  :2;
        unsigned AT1PREC                :1;
        unsigned AT1EN                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned AT1PS0                 :1;
        unsigned AT1PS1                 :1;
    };
} AT1CON0bits_t;
extern volatile AT1CON0bits_t AT1CON0bits __at(0x814);
// bitfield macros
#define _AT1CON0_MODE_POSN                                  0x0
#define _AT1CON0_MODE_POSITION                              0x0
#define _AT1CON0_MODE_SIZE                                  0x1
#define _AT1CON0_MODE_LENGTH                                0x1
#define _AT1CON0_MODE_MASK                                  0x1
#define _AT1CON0_APMOD_POSN                                 0x1
#define _AT1CON0_APMOD_POSITION                             0x1
#define _AT1CON0_APMOD_SIZE                                 0x1
#define _AT1CON0_APMOD_LENGTH                               0x1
#define _AT1CON0_APMOD_MASK                                 0x2
#define _AT1CON0_POL_POSN                                   0x3
#define _AT1CON0_POL_POSITION                               0x3
#define _AT1CON0_POL_SIZE                                   0x1
#define _AT1CON0_POL_LENGTH                                 0x1
#define _AT1CON0_POL_MASK                                   0x8
#define _AT1CON0_PS_POSN                                    0x4
#define _AT1CON0_PS_POSITION                                0x4
#define _AT1CON0_PS_SIZE                                    0x2
#define _AT1CON0_PS_LENGTH                                  0x2
#define _AT1CON0_PS_MASK                                    0x30
#define _AT1CON0_PREC_POSN                                  0x6
#define _AT1CON0_PREC_POSITION                              0x6
#define _AT1CON0_PREC_SIZE                                  0x1
#define _AT1CON0_PREC_LENGTH                                0x1
#define _AT1CON0_PREC_MASK                                  0x40
#define _AT1CON0_EN_POSN                                    0x7
#define _AT1CON0_EN_POSITION                                0x7
#define _AT1CON0_EN_SIZE                                    0x1
#define _AT1CON0_EN_LENGTH                                  0x1
#define _AT1CON0_EN_MASK                                    0x80
#define _AT1CON0_PS0_POSN                                   0x4
#define _AT1CON0_PS0_POSITION                               0x4
#define _AT1CON0_PS0_SIZE                                   0x1
#define _AT1CON0_PS0_LENGTH                                 0x1
#define _AT1CON0_PS0_MASK                                   0x10
#define _AT1CON0_PS1_POSN                                   0x5
#define _AT1CON0_PS1_POSITION                               0x5
#define _AT1CON0_PS1_SIZE                                   0x1
#define _AT1CON0_PS1_LENGTH                                 0x1
#define _AT1CON0_PS1_MASK                                   0x20
#define _AT1CON0_AT1MODE_POSN                               0x0
#define _AT1CON0_AT1MODE_POSITION                           0x0
#define _AT1CON0_AT1MODE_SIZE                               0x1
#define _AT1CON0_AT1MODE_LENGTH                             0x1
#define _AT1CON0_AT1MODE_MASK                               0x1
#define _AT1CON0_AT1APMOD_POSN                              0x1
#define _AT1CON0_AT1APMOD_POSITION                          0x1
#define _AT1CON0_AT1APMOD_SIZE                              0x1
#define _AT1CON0_AT1APMOD_LENGTH                            0x1
#define _AT1CON0_AT1APMOD_MASK                              0x2
#define _AT1CON0_AT1POL_POSN                                0x3
#define _AT1CON0_AT1POL_POSITION                            0x3
#define _AT1CON0_AT1POL_SIZE                                0x1
#define _AT1CON0_AT1POL_LENGTH                              0x1
#define _AT1CON0_AT1POL_MASK                                0x8
#define _AT1CON0_AT1PS_POSN                                 0x4
#define _AT1CON0_AT1PS_POSITION                             0x4
#define _AT1CON0_AT1PS_SIZE                                 0x2
#define _AT1CON0_AT1PS_LENGTH                               0x2
#define _AT1CON0_AT1PS_MASK                                 0x30
#define _AT1CON0_AT1PREC_POSN                               0x6
#define _AT1CON0_AT1PREC_POSITION                           0x6
#define _AT1CON0_AT1PREC_SIZE                               0x1
#define _AT1CON0_AT1PREC_LENGTH                             0x1
#define _AT1CON0_AT1PREC_MASK                               0x40
#define _AT1CON0_AT1EN_POSN                                 0x7
#define _AT1CON0_AT1EN_POSITION                             0x7
#define _AT1CON0_AT1EN_SIZE                                 0x1
#define _AT1CON0_AT1EN_LENGTH                               0x1
#define _AT1CON0_AT1EN_MASK                                 0x80
#define _AT1CON0_AT1PS0_POSN                                0x4
#define _AT1CON0_AT1PS0_POSITION                            0x4
#define _AT1CON0_AT1PS0_SIZE                                0x1
#define _AT1CON0_AT1PS0_LENGTH                              0x1
#define _AT1CON0_AT1PS0_MASK                                0x10
#define _AT1CON0_AT1PS1_POSN                                0x5
#define _AT1CON0_AT1PS1_POSITION                            0x5
#define _AT1CON0_AT1PS1_SIZE                                0x1
#define _AT1CON0_AT1PS1_LENGTH                              0x1
#define _AT1CON0_AT1PS1_MASK                                0x20

// Register: AT1CON1
#define AT1CON1 AT1CON1
extern volatile unsigned char           AT1CON1             __at(0x815);
#ifndef _LIB_BUILD
asm("AT1CON1 equ 0815h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VALID                  :1;
        unsigned ACCS                   :1;
        unsigned MPP                    :1;
        unsigned                        :1;
        unsigned PRP                    :1;
        unsigned                        :1;
        unsigned PHP                    :1;
    };
    struct {
        unsigned AT1VALID               :1;
        unsigned AT1ACCS                :1;
        unsigned AT1MPP                 :1;
        unsigned                        :1;
        unsigned AT1PRP                 :1;
        unsigned                        :1;
        unsigned AT1PHP                 :1;
    };
} AT1CON1bits_t;
extern volatile AT1CON1bits_t AT1CON1bits __at(0x815);
// bitfield macros
#define _AT1CON1_VALID_POSN                                 0x0
#define _AT1CON1_VALID_POSITION                             0x0
#define _AT1CON1_VALID_SIZE                                 0x1
#define _AT1CON1_VALID_LENGTH                               0x1
#define _AT1CON1_VALID_MASK                                 0x1
#define _AT1CON1_ACCS_POSN                                  0x1
#define _AT1CON1_ACCS_POSITION                              0x1
#define _AT1CON1_ACCS_SIZE                                  0x1
#define _AT1CON1_ACCS_LENGTH                                0x1
#define _AT1CON1_ACCS_MASK                                  0x2
#define _AT1CON1_MPP_POSN                                   0x2
#define _AT1CON1_MPP_POSITION                               0x2
#define _AT1CON1_MPP_SIZE                                   0x1
#define _AT1CON1_MPP_LENGTH                                 0x1
#define _AT1CON1_MPP_MASK                                   0x4
#define _AT1CON1_PRP_POSN                                   0x4
#define _AT1CON1_PRP_POSITION                               0x4
#define _AT1CON1_PRP_SIZE                                   0x1
#define _AT1CON1_PRP_LENGTH                                 0x1
#define _AT1CON1_PRP_MASK                                   0x10
#define _AT1CON1_PHP_POSN                                   0x6
#define _AT1CON1_PHP_POSITION                               0x6
#define _AT1CON1_PHP_SIZE                                   0x1
#define _AT1CON1_PHP_LENGTH                                 0x1
#define _AT1CON1_PHP_MASK                                   0x40
#define _AT1CON1_AT1VALID_POSN                              0x0
#define _AT1CON1_AT1VALID_POSITION                          0x0
#define _AT1CON1_AT1VALID_SIZE                              0x1
#define _AT1CON1_AT1VALID_LENGTH                            0x1
#define _AT1CON1_AT1VALID_MASK                              0x1
#define _AT1CON1_AT1ACCS_POSN                               0x1
#define _AT1CON1_AT1ACCS_POSITION                           0x1
#define _AT1CON1_AT1ACCS_SIZE                               0x1
#define _AT1CON1_AT1ACCS_LENGTH                             0x1
#define _AT1CON1_AT1ACCS_MASK                               0x2
#define _AT1CON1_AT1MPP_POSN                                0x2
#define _AT1CON1_AT1MPP_POSITION                            0x2
#define _AT1CON1_AT1MPP_SIZE                                0x1
#define _AT1CON1_AT1MPP_LENGTH                              0x1
#define _AT1CON1_AT1MPP_MASK                                0x4
#define _AT1CON1_AT1PRP_POSN                                0x4
#define _AT1CON1_AT1PRP_POSITION                            0x4
#define _AT1CON1_AT1PRP_SIZE                                0x1
#define _AT1CON1_AT1PRP_LENGTH                              0x1
#define _AT1CON1_AT1PRP_MASK                                0x10
#define _AT1CON1_AT1PHP_POSN                                0x6
#define _AT1CON1_AT1PHP_POSITION                            0x6
#define _AT1CON1_AT1PHP_SIZE                                0x1
#define _AT1CON1_AT1PHP_LENGTH                              0x1
#define _AT1CON1_AT1PHP_MASK                                0x40

// Register: AT1IR0
#define AT1IR0 AT1IR0
extern volatile unsigned char           AT1IR0              __at(0x816);
#ifndef _LIB_BUILD
asm("AT1IR0 equ 0816h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1PERIF               :1;
        unsigned AT1MISSIF              :1;
        unsigned AT1PHSIF               :1;
    };
} AT1IR0bits_t;
