MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1615/mcu.h
// Register: AT1ERRL
#define AT1ERRL AT1ERRL
extern volatile unsigned char           AT1ERRL             __at(0x81C);
#ifndef _LIB_BUILD
asm("AT1ERRL equ 081Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1ERR0                :1;
        unsigned AT1ERR1                :1;
        unsigned AT1ERR2                :1;
        unsigned AT1ERR3                :1;
        unsigned AT1ERR4                :1;
        unsigned AT1ERR5                :1;
        unsigned AT1ERR6                :1;
        unsigned AT1ERR7                :1;
    };
    struct {
        unsigned ERR0                   :1;
        unsigned ERR1                   :1;
        unsigned ERR2                   :1;
        unsigned ERR3                   :1;
        unsigned ERR4                   :1;
        unsigned ERR5                   :1;
        unsigned ERR6                   :1;
        unsigned ERR7                   :1;
    };
    struct {
        unsigned ERRL0                  :1;
        unsigned ERRL1                  :1;
        unsigned ERRL2                  :1;
        unsigned ERRL3                  :1;
        unsigned ERRL4                  :1;
        unsigned ERRL5                  :1;
        unsigned ERRL6                  :1;
        unsigned ERRL7                  :1;
    };
} AT1ERRLbits_t;
extern volatile AT1ERRLbits_t AT1ERRLbits __at(0x81C);
// bitfield macros
#define _AT1ERRL_AT1ERR0_POSN                               0x0
#define _AT1ERRL_AT1ERR0_POSITION                           0x0
#define _AT1ERRL_AT1ERR0_SIZE                               0x1
#define _AT1ERRL_AT1ERR0_LENGTH                             0x1
#define _AT1ERRL_AT1ERR0_MASK                               0x1
#define _AT1ERRL_AT1ERR1_POSN                               0x1
#define _AT1ERRL_AT1ERR1_POSITION                           0x1
#define _AT1ERRL_AT1ERR1_SIZE                               0x1
#define _AT1ERRL_AT1ERR1_LENGTH                             0x1
#define _AT1ERRL_AT1ERR1_MASK                               0x2
#define _AT1ERRL_AT1ERR2_POSN                               0x2
#define _AT1ERRL_AT1ERR2_POSITION                           0x2
#define _AT1ERRL_AT1ERR2_SIZE                               0x1
#define _AT1ERRL_AT1ERR2_LENGTH                             0x1
#define _AT1ERRL_AT1ERR2_MASK                               0x4
#define _AT1ERRL_AT1ERR3_POSN                               0x3
#define _AT1ERRL_AT1ERR3_POSITION                           0x3
#define _AT1ERRL_AT1ERR3_SIZE                               0x1
#define _AT1ERRL_AT1ERR3_LENGTH                             0x1
#define _AT1ERRL_AT1ERR3_MASK                               0x8
#define _AT1ERRL_AT1ERR4_POSN                               0x4
#define _AT1ERRL_AT1ERR4_POSITION                           0x4
#define _AT1ERRL_AT1ERR4_SIZE                               0x1
#define _AT1ERRL_AT1ERR4_LENGTH                             0x1
#define _AT1ERRL_AT1ERR4_MASK                               0x10
#define _AT1ERRL_AT1ERR5_POSN                               0x5
#define _AT1ERRL_AT1ERR5_POSITION                           0x5
#define _AT1ERRL_AT1ERR5_SIZE                               0x1
#define _AT1ERRL_AT1ERR5_LENGTH                             0x1
#define _AT1ERRL_AT1ERR5_MASK                               0x20
#define _AT1ERRL_AT1ERR6_POSN                               0x6
#define _AT1ERRL_AT1ERR6_POSITION                           0x6
#define _AT1ERRL_AT1ERR6_SIZE                               0x1
#define _AT1ERRL_AT1ERR6_LENGTH                             0x1
#define _AT1ERRL_AT1ERR6_MASK                               0x40
#define _AT1ERRL_AT1ERR7_POSN                               0x7
#define _AT1ERRL_AT1ERR7_POSITION                           0x7
#define _AT1ERRL_AT1ERR7_SIZE                               0x1
#define _AT1ERRL_AT1ERR7_LENGTH                             0x1
#define _AT1ERRL_AT1ERR7_MASK                               0x80
#define _AT1ERRL_ERR0_POSN                                  0x0
#define _AT1ERRL_ERR0_POSITION                              0x0
#define _AT1ERRL_ERR0_SIZE                                  0x1
#define _AT1ERRL_ERR0_LENGTH                                0x1
#define _AT1ERRL_ERR0_MASK                                  0x1
#define _AT1ERRL_ERR1_POSN                                  0x1
#define _AT1ERRL_ERR1_POSITION                              0x1
#define _AT1ERRL_ERR1_SIZE                                  0x1
#define _AT1ERRL_ERR1_LENGTH                                0x1
#define _AT1ERRL_ERR1_MASK                                  0x2
#define _AT1ERRL_ERR2_POSN                                  0x2
#define _AT1ERRL_ERR2_POSITION                              0x2
#define _AT1ERRL_ERR2_SIZE                                  0x1
#define _AT1ERRL_ERR2_LENGTH                                0x1
#define _AT1ERRL_ERR2_MASK                                  0x4
#define _AT1ERRL_ERR3_POSN                                  0x3
#define _AT1ERRL_ERR3_POSITION                              0x3
#define _AT1ERRL_ERR3_SIZE                                  0x1
#define _AT1ERRL_ERR3_LENGTH                                0x1
#define _AT1ERRL_ERR3_MASK                                  0x8
#define _AT1ERRL_ERR4_POSN                                  0x4
#define _AT1ERRL_ERR4_POSITION                              0x4
#define _AT1ERRL_ERR4_SIZE                                  0x1
#define _AT1ERRL_ERR4_LENGTH                                0x1
#define _AT1ERRL_ERR4_MASK                                  0x10
#define _AT1ERRL_ERR5_POSN                                  0x5
#define _AT1ERRL_ERR5_POSITION                              0x5
#define _AT1ERRL_ERR5_SIZE                                  0x1
#define _AT1ERRL_ERR5_LENGTH                                0x1
#define _AT1ERRL_ERR5_MASK                                  0x20
#define _AT1ERRL_ERR6_POSN                                  0x6
#define _AT1ERRL_ERR6_POSITION                              0x6
#define _AT1ERRL_ERR6_SIZE                                  0x1
#define _AT1ERRL_ERR6_LENGTH                                0x1
#define _AT1ERRL_ERR6_MASK                                  0x40
#define _AT1ERRL_ERR7_POSN                                  0x7
#define _AT1ERRL_ERR7_POSITION                              0x7
#define _AT1ERRL_ERR7_SIZE                                  0x1
#define _AT1ERRL_ERR7_LENGTH                                0x1
#define _AT1ERRL_ERR7_MASK                                  0x80
#define _AT1ERRL_ERRL0_POSN                                 0x0
#define _AT1ERRL_ERRL0_POSITION                             0x0
#define _AT1ERRL_ERRL0_SIZE                                 0x1
#define _AT1ERRL_ERRL0_LENGTH                               0x1
#define _AT1ERRL_ERRL0_MASK                                 0x1
#define _AT1ERRL_ERRL1_POSN                                 0x1
#define _AT1ERRL_ERRL1_POSITION                             0x1
#define _AT1ERRL_ERRL1_SIZE                                 0x1
#define _AT1ERRL_ERRL1_LENGTH                               0x1
#define _AT1ERRL_ERRL1_MASK                                 0x2
#define _AT1ERRL_ERRL2_POSN                                 0x2
#define _AT1ERRL_ERRL2_POSITION                             0x2
#define _AT1ERRL_ERRL2_SIZE                                 0x1
#define _AT1ERRL_ERRL2_LENGTH                               0x1
#define _AT1ERRL_ERRL2_MASK                                 0x4
#define _AT1ERRL_ERRL3_POSN                                 0x3
#define _AT1ERRL_ERRL3_POSITION                             0x3
#define _AT1ERRL_ERRL3_SIZE                                 0x1
#define _AT1ERRL_ERRL3_LENGTH                               0x1
#define _AT1ERRL_ERRL3_MASK                                 0x8
#define _AT1ERRL_ERRL4_POSN                                 0x4
#define _AT1ERRL_ERRL4_POSITION                             0x4
#define _AT1ERRL_ERRL4_SIZE                                 0x1
#define _AT1ERRL_ERRL4_LENGTH                               0x1
#define _AT1ERRL_ERRL4_MASK                                 0x10
#define _AT1ERRL_ERRL5_POSN                                 0x5
#define _AT1ERRL_ERRL5_POSITION                             0x5
#define _AT1ERRL_ERRL5_SIZE                                 0x1
#define _AT1ERRL_ERRL5_LENGTH                               0x1
#define _AT1ERRL_ERRL5_MASK                                 0x20
#define _AT1ERRL_ERRL6_POSN                                 0x6
#define _AT1ERRL_ERRL6_POSITION                             0x6
#define _AT1ERRL_ERRL6_SIZE                                 0x1
#define _AT1ERRL_ERRL6_LENGTH                               0x1
#define _AT1ERRL_ERRL6_MASK                                 0x40
#define _AT1ERRL_ERRL7_POSN                                 0x7
#define _AT1ERRL_ERRL7_POSITION                             0x7
#define _AT1ERRL_ERRL7_SIZE                                 0x1
#define _AT1ERRL_ERRL7_LENGTH                               0x1
#define _AT1ERRL_ERRL7_MASK                                 0x80

// Register: AT1ERRH
#define AT1ERRH AT1ERRH
extern volatile unsigned char           AT1ERRH             __at(0x81D);
#ifndef _LIB_BUILD
asm("AT1ERRH equ 081Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AT1ERR8                :1;
        unsigned AT1ERR9                :1;
        unsigned AT1ERR10               :1;
        unsigned AT1ERR11               :1;
        unsigned AT1ERR12               :1;
        unsigned AT1ERR13               :1;
        unsigned AT1ERR14               :1;
        unsigned AT1ERR15               :1;
    };
    struct {
        unsigned ERR8                   :1;
        unsigned ERR9                   :1;
        unsigned ERR10                  :1;
        unsigned ERR11                  :1;
        unsigned ERR12                  :1;
        unsigned ERR13                  :1;
        unsigned ERR14                  :1;
        unsigned ERR15                  :1;
    };
    struct {
        unsigned ERRH0                  :1;
        unsigned ERRH1                  :1;
        unsigned ERRH2                  :1;
        unsigned ERRH3                  :1;
        unsigned ERRH4                  :1;
        unsigned ERRH5                  :1;
        unsigned ERRH6                  :1;
        unsigned ERRH7                  :1;
    };
} AT1ERRHbits_t;
extern volatile AT1ERRHbits_t AT1ERRHbits __at(0x81D);
// bitfield macros
#define _AT1ERRH_AT1ERR8_POSN                               0x0
#define _AT1ERRH_AT1ERR8_POSITION                           0x0
#define _AT1ERRH_AT1ERR8_SIZE                               0x1
#define _AT1ERRH_AT1ERR8_LENGTH                             0x1
#define _AT1ERRH_AT1ERR8_MASK                               0x1
#define _AT1ERRH_AT1ERR9_POSN                               0x1
#define _AT1ERRH_AT1ERR9_POSITION                           0x1
#define _AT1ERRH_AT1ERR9_SIZE                               0x1
#define _AT1ERRH_AT1ERR9_LENGTH                             0x1
#define _AT1ERRH_AT1ERR9_MASK                               0x2
#define _AT1ERRH_AT1ERR10_POSN                              0x2
#define _AT1ERRH_AT1ERR10_POSITION                          0x2
#define _AT1ERRH_AT1ERR10_SIZE                              0x1
#define _AT1ERRH_AT1ERR10_LENGTH                            0x1
#define _AT1ERRH_AT1ERR10_MASK                              0x4
#define _AT1ERRH_AT1ERR11_POSN                              0x3
#define _AT1ERRH_AT1ERR11_POSITION                          0x3
#define _AT1ERRH_AT1ERR11_SIZE                              0x1
#define _AT1ERRH_AT1ERR11_LENGTH                            0x1
#define _AT1ERRH_AT1ERR11_MASK                              0x8
#define _AT1ERRH_AT1ERR12_POSN                              0x4
#define _AT1ERRH_AT1ERR12_POSITION                          0x4
#define _AT1ERRH_AT1ERR12_SIZE                              0x1
#define _AT1ERRH_AT1ERR12_LENGTH                            0x1
#define _AT1ERRH_AT1ERR12_MASK                              0x10
#define _AT1ERRH_AT1ERR13_POSN                              0x5
#define _AT1ERRH_AT1ERR13_POSITION                          0x5
#define _AT1ERRH_AT1ERR13_SIZE                              0x1
#define _AT1ERRH_AT1ERR13_LENGTH                            0x1
#define _AT1ERRH_AT1ERR13_MASK                              0x20
#define _AT1ERRH_AT1ERR14_POSN                              0x6
#define _AT1ERRH_AT1ERR14_POSITION                          0x6
#define _AT1ERRH_AT1ERR14_SIZE                              0x1
#define _AT1ERRH_AT1ERR14_LENGTH                            0x1
#define _AT1ERRH_AT1ERR14_MASK                              0x40
#define _AT1ERRH_AT1ERR15_POSN                              0x7
#define _AT1ERRH_AT1ERR15_POSITION                          0x7
#define _AT1ERRH_AT1ERR15_SIZE                              0x1
#define _AT1ERRH_AT1ERR15_LENGTH                            0x1
#define _AT1ERRH_AT1ERR15_MASK                              0x80
#define _AT1ERRH_ERR8_POSN                                  0x0
#define _AT1ERRH_ERR8_POSITION                              0x0
#define _AT1ERRH_ERR8_SIZE                                  0x1
#define _AT1ERRH_ERR8_LENGTH                                0x1
#define _AT1ERRH_ERR8_MASK                                  0x1
#define _AT1ERRH_ERR9_POSN                                  0x1
#define _AT1ERRH_ERR9_POSITION                              0x1
#define _AT1ERRH_ERR9_SIZE                                  0x1
#define _AT1ERRH_ERR9_LENGTH                                0x1
#define _AT1ERRH_ERR9_MASK                                  0x2
#define _AT1ERRH_ERR10_POSN                                 0x2
#define _AT1ERRH_ERR10_POSITION                             0x2
#define _AT1ERRH_ERR10_SIZE                                 0x1
#define _AT1ERRH_ERR10_LENGTH                               0x1
#define _AT1ERRH_ERR10_MASK                                 0x4
#define _AT1ERRH_ERR11_POSN                                 0x3
#define _AT1ERRH_ERR11_POSITION                             0x3
#define _AT1ERRH_ERR11_SIZE                                 0x1
#define _AT1ERRH_ERR11_LENGTH                               0x1
#define _AT1ERRH_ERR11_MASK                                 0x8
#define _AT1ERRH_ERR12_POSN                                 0x4
#define _AT1ERRH_ERR12_POSITION                             0x4
#define _AT1ERRH_ERR12_SIZE                                 0x1
#define _AT1ERRH_ERR12_LENGTH                               0x1
#define _AT1ERRH_ERR12_MASK                                 0x10
#define _AT1ERRH_ERR13_POSN                                 0x5
#define _AT1ERRH_ERR13_POSITION                             0x5
#define _AT1ERRH_ERR13_SIZE                                 0x1
#define _AT1ERRH_ERR13_LENGTH                               0x1
#define _AT1ERRH_ERR13_MASK                                 0x20
#define _AT1ERRH_ERR14_POSN                                 0x6
#define _AT1ERRH_ERR14_POSITION                             0x6
#define _AT1ERRH_ERR14_SIZE                                 0x1
#define _AT1ERRH_ERR14_LENGTH                               0x1
#define _AT1ERRH_ERR14_MASK                                 0x40
#define _AT1ERRH_ERR15_POSN                                 0x7
#define _AT1ERRH_ERR15_POSITION                             0x7
#define _AT1ERRH_ERR15_SIZE                                 0x1
#define _AT1ERRH_ERR15_LENGTH                               0x1
#define _AT1ERRH_ERR15_MASK                                 0x80
#define _AT1ERRH_ERRH0_POSN                                 0x0
#define _AT1ERRH_ERRH0_POSITION                             0x0
#define _AT1ERRH_ERRH0_SIZE                                 0x1
#define _AT1ERRH_ERRH0_LENGTH                               0x1
#define _AT1ERRH_ERRH0_MASK                                 0x1
#define _AT1ERRH_ERRH1_POSN                                 0x1
#define _AT1ERRH_ERRH1_POSITION                             0x1
#define _AT1ERRH_ERRH1_SIZE                                 0x1
#define _AT1ERRH_ERRH1_LENGTH                               0x1
#define _AT1ERRH_ERRH1_MASK                                 0x2
#define _AT1ERRH_ERRH2_POSN                                 0x2
#define _AT1ERRH_ERRH2_POSITION                             0x2
#define _AT1ERRH_ERRH2_SIZE                                 0x1
#define _AT1ERRH_ERRH2_LENGTH                               0x1
#define _AT1ERRH_ERRH2_MASK                                 0x4
#define _AT1ERRH_ERRH3_POSN                                 0x3
#define _AT1ERRH_ERRH3_POSITION                             0x3
#define _AT1ERRH_ERRH3_SIZE                                 0x1
#define _AT1ERRH_ERRH3_LENGTH                               0x1
#define _AT1ERRH_ERRH3_MASK                                 0x8
#define _AT1ERRH_ERRH4_POSN                                 0x4
#define _AT1ERRH_ERRH4_POSITION                             0x4
#define _AT1ERRH_ERRH4_SIZE                                 0x1
#define _AT1ERRH_ERRH4_LENGTH                               0x1
#define _AT1ERRH_ERRH4_MASK                                 0x10
#define _AT1ERRH_ERRH5_POSN                                 0x5
#define _AT1ERRH_ERRH5_POSITION                             0x5
#define _AT1ERRH_ERRH5_SIZE                                 0x1
#define _AT1ERRH_ERRH5_LENGTH                               0x1
#define _AT1ERRH_ERRH5_MASK                                 0x20
#define _AT1ERRH_ERRH6_POSN                                 0x6
#define _AT1ERRH_ERRH6_POSITION                             0x6
#define _AT1ERRH_ERRH6_SIZE                                 0x1
#define _AT1ERRH_ERRH6_LENGTH                               0x1
#define _AT1ERRH_ERRH6_MASK                                 0x40
#define _AT1ERRH_ERRH7_POSN                                 0x7
#define _AT1ERRH_ERRH7_POSITION                             0x7
#define _AT1ERRH_ERRH7_SIZE                                 0x1
#define _AT1ERRH_ERRH7_LENGTH                               0x1
#define _AT1ERRH_ERRH7_MASK                                 0x80

// Register: AT1CLK
#define AT1CLK AT1CLK
extern volatile unsigned char           AT1CLK              __at(0x88C);
#ifndef _LIB_BUILD
asm("AT1CLK equ 088Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned AT1CS                  :1;
    };
    struct {
        unsigned CS0                    :1;
    };
    struct {
        unsigned AT1CS0                 :1;
    };
} AT1CLKbits_t;
