MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1615/mcu.h
extern volatile T4CKIPPSbits_t T4CKIPPSbits __at(0xE1B);
// bitfield macros
#define _T4CKIPPS_T4CKIPPS_POSN                             0x0
#define _T4CKIPPS_T4CKIPPS_POSITION                         0x0
#define _T4CKIPPS_T4CKIPPS_SIZE                             0x5
#define _T4CKIPPS_T4CKIPPS_LENGTH                           0x5
#define _T4CKIPPS_T4CKIPPS_MASK                             0x1F
#define _T4CKIPPS_T4CKIPPS0_POSN                            0x0
#define _T4CKIPPS_T4CKIPPS0_POSITION                        0x0
#define _T4CKIPPS_T4CKIPPS0_SIZE                            0x1
#define _T4CKIPPS_T4CKIPPS0_LENGTH                          0x1
#define _T4CKIPPS_T4CKIPPS0_MASK                            0x1
#define _T4CKIPPS_T4CKIPPS1_POSN                            0x1
#define _T4CKIPPS_T4CKIPPS1_POSITION                        0x1
#define _T4CKIPPS_T4CKIPPS1_SIZE                            0x1
#define _T4CKIPPS_T4CKIPPS1_LENGTH                          0x1
#define _T4CKIPPS_T4CKIPPS1_MASK                            0x2
#define _T4CKIPPS_T4CKIPPS2_POSN                            0x2
#define _T4CKIPPS_T4CKIPPS2_POSITION                        0x2
#define _T4CKIPPS_T4CKIPPS2_SIZE                            0x1
#define _T4CKIPPS_T4CKIPPS2_LENGTH                          0x1
#define _T4CKIPPS_T4CKIPPS2_MASK                            0x4
#define _T4CKIPPS_T4CKIPPS3_POSN                            0x3
#define _T4CKIPPS_T4CKIPPS3_POSITION                        0x3
#define _T4CKIPPS_T4CKIPPS3_SIZE                            0x1
#define _T4CKIPPS_T4CKIPPS3_LENGTH                          0x1
#define _T4CKIPPS_T4CKIPPS3_MASK                            0x8
#define _T4CKIPPS_T4CKIPPS4_POSN                            0x4
#define _T4CKIPPS_T4CKIPPS4_POSITION                        0x4
#define _T4CKIPPS_T4CKIPPS4_SIZE                            0x1
#define _T4CKIPPS_T4CKIPPS4_LENGTH                          0x1
#define _T4CKIPPS_T4CKIPPS4_MASK                            0x10
#define _T4CKIPPS_T4PPS_POSN                                0x0
#define _T4CKIPPS_T4PPS_POSITION                            0x0
#define _T4CKIPPS_T4PPS_SIZE                                0x5
#define _T4CKIPPS_T4PPS_LENGTH                              0x5
#define _T4CKIPPS_T4PPS_MASK                                0x1F
#define _T4CKIPPS_T4PPS0_POSN                               0x0
#define _T4CKIPPS_T4PPS0_POSITION                           0x0
#define _T4CKIPPS_T4PPS0_SIZE                               0x1
#define _T4CKIPPS_T4PPS0_LENGTH                             0x1
#define _T4CKIPPS_T4PPS0_MASK                               0x1
#define _T4CKIPPS_T4PPS1_POSN                               0x1
#define _T4CKIPPS_T4PPS1_POSITION                           0x1
#define _T4CKIPPS_T4PPS1_SIZE                               0x1
#define _T4CKIPPS_T4PPS1_LENGTH                             0x1
#define _T4CKIPPS_T4PPS1_MASK                               0x2
#define _T4CKIPPS_T4PPS2_POSN                               0x2
#define _T4CKIPPS_T4PPS2_POSITION                           0x2
#define _T4CKIPPS_T4PPS2_SIZE                               0x1
#define _T4CKIPPS_T4PPS2_LENGTH                             0x1
#define _T4CKIPPS_T4PPS2_MASK                               0x4
#define _T4CKIPPS_T4PPS3_POSN                               0x3
#define _T4CKIPPS_T4PPS3_POSITION                           0x3
#define _T4CKIPPS_T4PPS3_SIZE                               0x1
#define _T4CKIPPS_T4PPS3_LENGTH                             0x1
#define _T4CKIPPS_T4PPS3_MASK                               0x8
#define _T4CKIPPS_T4PPS4_POSN                               0x4
#define _T4CKIPPS_T4PPS4_POSITION                           0x4
#define _T4CKIPPS_T4PPS4_SIZE                               0x1
#define _T4CKIPPS_T4PPS4_LENGTH                             0x1
#define _T4CKIPPS_T4PPS4_MASK                               0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned T4CKIPPS               :5;
    };
    struct {
        unsigned T4CKIPPS0              :1;
        unsigned T4CKIPPS1              :1;
        unsigned T4CKIPPS2              :1;
        unsigned T4CKIPPS3              :1;
        unsigned T4CKIPPS4              :1;
    };
    struct {
        unsigned T4PPS                  :5;
    };
    struct {
        unsigned T4PPS0                 :1;
        unsigned T4PPS1                 :1;
        unsigned T4PPS2                 :1;
        unsigned T4PPS3                 :1;
        unsigned T4PPS4                 :1;
    };
} T4PPSbits_t;
extern volatile T4PPSbits_t T4PPSbits __at(0xE1B);
// bitfield macros
#define _T4PPS_T4CKIPPS_POSN                                0x0
#define _T4PPS_T4CKIPPS_POSITION                            0x0
#define _T4PPS_T4CKIPPS_SIZE                                0x5
#define _T4PPS_T4CKIPPS_LENGTH                              0x5
#define _T4PPS_T4CKIPPS_MASK                                0x1F
#define _T4PPS_T4CKIPPS0_POSN                               0x0
#define _T4PPS_T4CKIPPS0_POSITION                           0x0
#define _T4PPS_T4CKIPPS0_SIZE                               0x1
#define _T4PPS_T4CKIPPS0_LENGTH                             0x1
#define _T4PPS_T4CKIPPS0_MASK                               0x1
#define _T4PPS_T4CKIPPS1_POSN                               0x1
#define _T4PPS_T4CKIPPS1_POSITION                           0x1
#define _T4PPS_T4CKIPPS1_SIZE                               0x1
#define _T4PPS_T4CKIPPS1_LENGTH                             0x1
#define _T4PPS_T4CKIPPS1_MASK                               0x2
#define _T4PPS_T4CKIPPS2_POSN                               0x2
#define _T4PPS_T4CKIPPS2_POSITION                           0x2
#define _T4PPS_T4CKIPPS2_SIZE                               0x1
#define _T4PPS_T4CKIPPS2_LENGTH                             0x1
#define _T4PPS_T4CKIPPS2_MASK                               0x4
#define _T4PPS_T4CKIPPS3_POSN                               0x3
#define _T4PPS_T4CKIPPS3_POSITION                           0x3
#define _T4PPS_T4CKIPPS3_SIZE                               0x1
#define _T4PPS_T4CKIPPS3_LENGTH                             0x1
#define _T4PPS_T4CKIPPS3_MASK                               0x8
#define _T4PPS_T4CKIPPS4_POSN                               0x4
#define _T4PPS_T4CKIPPS4_POSITION                           0x4
#define _T4PPS_T4CKIPPS4_SIZE                               0x1
#define _T4PPS_T4CKIPPS4_LENGTH                             0x1
#define _T4PPS_T4CKIPPS4_MASK                               0x10
#define _T4PPS_T4PPS_POSN                                   0x0
#define _T4PPS_T4PPS_POSITION                               0x0
#define _T4PPS_T4PPS_SIZE                                   0x5
#define _T4PPS_T4PPS_LENGTH                                 0x5
#define _T4PPS_T4PPS_MASK                                   0x1F
#define _T4PPS_T4PPS0_POSN                                  0x0
#define _T4PPS_T4PPS0_POSITION                              0x0
#define _T4PPS_T4PPS0_SIZE                                  0x1
#define _T4PPS_T4PPS0_LENGTH                                0x1
#define _T4PPS_T4PPS0_MASK                                  0x1
#define _T4PPS_T4PPS1_POSN                                  0x1
#define _T4PPS_T4PPS1_POSITION                              0x1
#define _T4PPS_T4PPS1_SIZE                                  0x1
#define _T4PPS_T4PPS1_LENGTH                                0x1
#define _T4PPS_T4PPS1_MASK                                  0x2
#define _T4PPS_T4PPS2_POSN                                  0x2
#define _T4PPS_T4PPS2_POSITION                              0x2
#define _T4PPS_T4PPS2_SIZE                                  0x1
#define _T4PPS_T4PPS2_LENGTH                                0x1
#define _T4PPS_T4PPS2_MASK                                  0x4
#define _T4PPS_T4PPS3_POSN                                  0x3
#define _T4PPS_T4PPS3_POSITION                              0x3
#define _T4PPS_T4PPS3_SIZE                                  0x1
#define _T4PPS_T4PPS3_LENGTH                                0x1
#define _T4PPS_T4PPS3_MASK                                  0x8
#define _T4PPS_T4PPS4_POSN                                  0x4
#define _T4PPS_T4PPS4_POSITION                              0x4
#define _T4PPS_T4PPS4_SIZE                                  0x1
#define _T4PPS_T4PPS4_LENGTH                                0x1
#define _T4PPS_T4PPS4_MASK                                  0x10

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
extern volatile unsigned char           T5CKIPPS            __at(0xE1C);
#ifndef _LIB_BUILD
asm("T5CKIPPS equ 0E1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5CKIPPS               :5;
    };
    struct {
        unsigned T5CKIPPS0              :1;
        unsigned T5CKIPPS1              :1;
        unsigned T5CKIPPS2              :1;
        unsigned T5CKIPPS3              :1;
        unsigned T5CKIPPS4              :1;
    };
} T5CKIPPSbits_t;
extern volatile T5CKIPPSbits_t T5CKIPPSbits __at(0xE1C);
// bitfield macros
#define _T5CKIPPS_T5CKIPPS_POSN                             0x0
#define _T5CKIPPS_T5CKIPPS_POSITION                         0x0
#define _T5CKIPPS_T5CKIPPS_SIZE                             0x5
#define _T5CKIPPS_T5CKIPPS_LENGTH                           0x5
#define _T5CKIPPS_T5CKIPPS_MASK                             0x1F
#define _T5CKIPPS_T5CKIPPS0_POSN                            0x0
#define _T5CKIPPS_T5CKIPPS0_POSITION                        0x0
#define _T5CKIPPS_T5CKIPPS0_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS0_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS0_MASK                            0x1
#define _T5CKIPPS_T5CKIPPS1_POSN                            0x1
#define _T5CKIPPS_T5CKIPPS1_POSITION                        0x1
#define _T5CKIPPS_T5CKIPPS1_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS1_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS1_MASK                            0x2
#define _T5CKIPPS_T5CKIPPS2_POSN                            0x2
#define _T5CKIPPS_T5CKIPPS2_POSITION                        0x2
#define _T5CKIPPS_T5CKIPPS2_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS2_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS2_MASK                            0x4
#define _T5CKIPPS_T5CKIPPS3_POSN                            0x3
#define _T5CKIPPS_T5CKIPPS3_POSITION                        0x3
#define _T5CKIPPS_T5CKIPPS3_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS3_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS3_MASK                            0x8
#define _T5CKIPPS_T5CKIPPS4_POSN                            0x4
#define _T5CKIPPS_T5CKIPPS4_POSITION                        0x4
#define _T5CKIPPS_T5CKIPPS4_SIZE                            0x1
#define _T5CKIPPS_T5CKIPPS4_LENGTH                          0x1
#define _T5CKIPPS_T5CKIPPS4_MASK                            0x10

// Register: T5GPPS
#define T5GPPS T5GPPS
extern volatile unsigned char           T5GPPS              __at(0xE1D);
#ifndef _LIB_BUILD
asm("T5GPPS equ 0E1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5GPPS                 :5;
    };
    struct {
        unsigned T5GPPS0                :1;
        unsigned T5GPPS1                :1;
        unsigned T5GPPS2                :1;
        unsigned T5GPPS3                :1;
        unsigned T5GPPS4                :1;
    };
} T5GPPSbits_t;
extern volatile T5GPPSbits_t T5GPPSbits __at(0xE1D);
// bitfield macros
#define _T5GPPS_T5GPPS_POSN                                 0x0
#define _T5GPPS_T5GPPS_POSITION                             0x0
#define _T5GPPS_T5GPPS_SIZE                                 0x5
#define _T5GPPS_T5GPPS_LENGTH                               0x5
#define _T5GPPS_T5GPPS_MASK                                 0x1F
#define _T5GPPS_T5GPPS0_POSN                                0x0
#define _T5GPPS_T5GPPS0_POSITION                            0x0
#define _T5GPPS_T5GPPS0_SIZE                                0x1
#define _T5GPPS_T5GPPS0_LENGTH                              0x1
#define _T5GPPS_T5GPPS0_MASK                                0x1
#define _T5GPPS_T5GPPS1_POSN                                0x1
#define _T5GPPS_T5GPPS1_POSITION                            0x1
#define _T5GPPS_T5GPPS1_SIZE                                0x1
#define _T5GPPS_T5GPPS1_LENGTH                              0x1
#define _T5GPPS_T5GPPS1_MASK                                0x2
#define _T5GPPS_T5GPPS2_POSN                                0x2
#define _T5GPPS_T5GPPS2_POSITION                            0x2
#define _T5GPPS_T5GPPS2_SIZE                                0x1
#define _T5GPPS_T5GPPS2_LENGTH                              0x1
#define _T5GPPS_T5GPPS2_MASK                                0x4
#define _T5GPPS_T5GPPS3_POSN                                0x3
#define _T5GPPS_T5GPPS3_POSITION                            0x3
#define _T5GPPS_T5GPPS3_SIZE                                0x1
#define _T5GPPS_T5GPPS3_LENGTH                              0x1
#define _T5GPPS_T5GPPS3_MASK                                0x8
#define _T5GPPS_T5GPPS4_POSN                                0x4
#define _T5GPPS_T5GPPS4_POSITION                            0x4
#define _T5GPPS_T5GPPS4_SIZE                                0x1
#define _T5GPPS_T5GPPS4_LENGTH                              0x1
#define _T5GPPS_T5GPPS4_MASK                                0x10

// Register: T6CKIPPS
#define T6CKIPPS T6CKIPPS
extern volatile unsigned char           T6CKIPPS            __at(0xE1E);
#ifndef _LIB_BUILD
asm("T6CKIPPS equ 0E1Eh");
#endif
// aliases
extern volatile unsigned char           T6PPS               __at(0xE1E);
#ifndef _LIB_BUILD
asm("T6PPS equ 0E1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T6CKIPPS               :5;
    };
    struct {
        unsigned T6CKIPPS0              :1;
        unsigned T6CKIPPS1              :1;
        unsigned T6CKIPPS2              :1;
        unsigned T6CKIPPS3              :1;
        unsigned T6CKIPPS4              :1;
    };
    struct {
        unsigned T6PPS                  :5;
    };
    struct {
        unsigned T6PPS0                 :1;
        unsigned T6PPS1                 :1;
        unsigned T6PPS2                 :1;
        unsigned T6PPS3                 :1;
        unsigned T6PPS4                 :1;
    };
} T6CKIPPSbits_t;
