MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1615/mcu.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// BAUD1CON<ABDEN>
extern volatile __bit                   ABDEN               __at(0xCF8);	// @ (0x19F * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUD1CON,0)
// BAUD1CON<ABDOVF>
extern volatile __bit                   ABDOVF              __at(0xCFF);	// @ (0x19F * 8 + 7)
#define                                 ABDOVF_bit          _BIT_ACCESS(BAUD1CON,7)
// PID1ACCHL<ACC16>
extern volatile __bit                   ACC16               __at(0x3088);	// @ (0x611 * 8 + 0)
#define                                 ACC16_bit           _BIT_ACCESS(PID1ACCHL,0)
// PID1ACCHL<ACC17>
extern volatile __bit                   ACC17               __at(0x3089);	// @ (0x611 * 8 + 1)
#define                                 ACC17_bit           _BIT_ACCESS(PID1ACCHL,1)
// PID1ACCHL<ACC18>
extern volatile __bit                   ACC18               __at(0x308A);	// @ (0x611 * 8 + 2)
#define                                 ACC18_bit           _BIT_ACCESS(PID1ACCHL,2)
// PID1ACCHL<ACC19>
extern volatile __bit                   ACC19               __at(0x308B);	// @ (0x611 * 8 + 3)
#define                                 ACC19_bit           _BIT_ACCESS(PID1ACCHL,3)
// PID1ACCHL<ACC20>
extern volatile __bit                   ACC20               __at(0x308C);	// @ (0x611 * 8 + 4)
#define                                 ACC20_bit           _BIT_ACCESS(PID1ACCHL,4)
// PID1ACCHL<ACC21>
extern volatile __bit                   ACC21               __at(0x308D);	// @ (0x611 * 8 + 5)
#define                                 ACC21_bit           _BIT_ACCESS(PID1ACCHL,5)
// PID1ACCHL<ACC22>
extern volatile __bit                   ACC22               __at(0x308E);	// @ (0x611 * 8 + 6)
#define                                 ACC22_bit           _BIT_ACCESS(PID1ACCHL,6)
// PID1ACCHL<ACC23>
extern volatile __bit                   ACC23               __at(0x308F);	// @ (0x611 * 8 + 7)
#define                                 ACC23_bit           _BIT_ACCESS(PID1ACCHL,7)
// PID1ACCHH<ACC24>
extern volatile __bit                   ACC24               __at(0x3090);	// @ (0x612 * 8 + 0)
#define                                 ACC24_bit           _BIT_ACCESS(PID1ACCHH,0)
// PID1ACCHH<ACC25>
extern volatile __bit                   ACC25               __at(0x3091);	// @ (0x612 * 8 + 1)
#define                                 ACC25_bit           _BIT_ACCESS(PID1ACCHH,1)
// PID1ACCHH<ACC26>
extern volatile __bit                   ACC26               __at(0x3092);	// @ (0x612 * 8 + 2)
#define                                 ACC26_bit           _BIT_ACCESS(PID1ACCHH,2)
// PID1ACCHH<ACC27>
extern volatile __bit                   ACC27               __at(0x3093);	// @ (0x612 * 8 + 3)
#define                                 ACC27_bit           _BIT_ACCESS(PID1ACCHH,3)
// PID1ACCHH<ACC28>
extern volatile __bit                   ACC28               __at(0x3094);	// @ (0x612 * 8 + 4)
#define                                 ACC28_bit           _BIT_ACCESS(PID1ACCHH,4)
// PID1ACCHH<ACC29>
extern volatile __bit                   ACC29               __at(0x3095);	// @ (0x612 * 8 + 5)
#define                                 ACC29_bit           _BIT_ACCESS(PID1ACCHH,5)
// PID1ACCHH<ACC30>
extern volatile __bit                   ACC30               __at(0x3096);	// @ (0x612 * 8 + 6)
#define                                 ACC30_bit           _BIT_ACCESS(PID1ACCHH,6)
// PID1ACCHH<ACC31>
extern volatile __bit                   ACC31               __at(0x3097);	// @ (0x612 * 8 + 7)
#define                                 ACC31_bit           _BIT_ACCESS(PID1ACCHH,7)
// PID1ACCU<ACC32>
extern volatile __bit                   ACC32               __at(0x3098);	// @ (0x613 * 8 + 0)
#define                                 ACC32_bit           _BIT_ACCESS(PID1ACCU,0)
// PID1ACCU<ACC33>
extern volatile __bit                   ACC33               __at(0x3099);	// @ (0x613 * 8 + 1)
#define                                 ACC33_bit           _BIT_ACCESS(PID1ACCU,1)
// PID1ACCU<ACC34>
extern volatile __bit                   ACC34               __at(0x309A);	// @ (0x613 * 8 + 2)
#define                                 ACC34_bit           _BIT_ACCESS(PID1ACCU,2)
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 ACCM_bit            _BIT_ACCESS(CRCCON0,4)
// AT1CON1<ACCS>
extern volatile __bit                   ACCS                __at(0x40A9);	// @ (0x815 * 8 + 1)
#define                                 ACCS_bit            _BIT_ACCESS(AT1CON1,1)
// SSP1CON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x10B5);	// @ (0x216 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x10B4);	// @ (0x216 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x10B6);	// @ (0x216 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSP1CON2,6)
// SSP1CON3<ACKTIM>
extern volatile __bit                   ACKTIM              __at(0x10BF);	// @ (0x217 * 8 + 7)
#define                                 ACKTIM_bit          _BIT_ACCESS(SSP1CON3,7)
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,6)
// SSP1ADD<ADD0>
extern volatile __bit                   ADD0                __at(0x1090);	// @ (0x212 * 8 + 0)
#define                                 ADD0_bit            _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<ADD1>
extern volatile __bit                   ADD1                __at(0x1091);	// @ (0x212 * 8 + 1)
#define                                 ADD1_bit            _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<ADD2>
extern volatile __bit                   ADD2                __at(0x1092);	// @ (0x212 * 8 + 2)
#define                                 ADD2_bit            _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<ADD3>
extern volatile __bit                   ADD3                __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 ADD3_bit            _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<ADD4>
extern volatile __bit                   ADD4                __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 ADD4_bit            _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<ADD5>
extern volatile __bit                   ADD5                __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 ADD5_bit            _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<ADD6>
extern volatile __bit                   ADD6                __at(0x1096);	// @ (0x212 * 8 + 6)
#define                                 ADD6_bit            _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<ADD7>
extern volatile __bit                   ADD7                __at(0x1097);	// @ (0x212 * 8 + 7)
#define                                 ADD7_bit            _BIT_ACCESS(SSP1ADD,7)
// RC1STA<ADDEN>
extern volatile __bit                   ADDEN               __at(0xCEB);	// @ (0x19D * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RC1STA,3)
// ADCON1<ADFM>
extern volatile __bit                   ADFM                __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON1,7)
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x8B8);	// @ (0x117 * 8 + 0)
#define                                 ADFVR0_bit          _BIT_ACCESS(FVRCON,0)
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x8B9);	// @ (0x117 * 8 + 1)
#define                                 ADFVR1_bit          _BIT_ACCESS(FVRCON,1)
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 ADGO_bit            _BIT_ACCESS(ADCON0,1)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x486);	// @ (0x90 * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADCON1<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 ADPREF0_bit         _BIT_ACCESS(ADCON1,0)
// ADCON1<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADCON1,1)
// SSP1CON3<AHEN>
extern volatile __bit                   AHEN                __at(0x10B9);	// @ (0x217 * 8 + 1)
#define                                 AHEN_bit            _BIT_ACCESS(SSP1CON3,1)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// ANSELC<ANSC0>
extern volatile __bit                   ANSC0               __at(0xC70);	// @ (0x18E * 8 + 0)
#define                                 ANSC0_bit           _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSC1>
extern volatile __bit                   ANSC1               __at(0xC71);	// @ (0x18E * 8 + 1)
#define                                 ANSC1_bit           _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSC2>
extern volatile __bit                   ANSC2               __at(0xC72);	// @ (0x18E * 8 + 2)
#define                                 ANSC2_bit           _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSC3>
extern volatile __bit                   ANSC3               __at(0xC73);	// @ (0x18E * 8 + 3)
#define                                 ANSC3_bit           _BIT_ACCESS(ANSELC,3)
// AT1CON0<APMOD>
extern volatile __bit                   APMOD               __at(0x40A1);	// @ (0x814 * 8 + 1)
#define                                 APMOD_bit           _BIT_ACCESS(AT1CON0,1)
// AT1CON1<AT1ACCS>
extern volatile __bit                   AT1ACCS             __at(0x40A9);	// @ (0x815 * 8 + 1)
#define                                 AT1ACCS_bit         _BIT_ACCESS(AT1CON1,1)
// AT1CON0<AT1APMOD>
extern volatile __bit                   AT1APMOD            __at(0x40A1);	// @ (0x814 * 8 + 1)
#define                                 AT1APMOD_bit        _BIT_ACCESS(AT1CON0,1)
// AT1CCON1<AT1CAP1P>
extern volatile __bit                   AT1CAP1P            __at(0x448B);	// @ (0x891 * 8 + 3)
#define                                 AT1CAP1P_bit        _BIT_ACCESS(AT1CCON1,3)
// AT1CCON2<AT1CAP2P>
extern volatile __bit                   AT1CAP2P            __at(0x44AB);	// @ (0x895 * 8 + 3)
#define                                 AT1CAP2P_bit        _BIT_ACCESS(AT1CCON2,3)
// AT1CCON3<AT1CAP3P>
extern volatile __bit                   AT1CAP3P            __at(0x44CB);	// @ (0x899 * 8 + 3)
#define                                 AT1CAP3P_bit        _BIT_ACCESS(AT1CCON3,3)
// AT1CC1L<AT1CC10>
extern volatile __bit                   AT1CC10             __at(0x4478);	// @ (0x88F * 8 + 0)
#define                                 AT1CC10_bit         _BIT_ACCESS(AT1CC1L,0)
// AT1CC1L<AT1CC11>
extern volatile __bit                   AT1CC11             __at(0x4479);	// @ (0x88F * 8 + 1)
#define                                 AT1CC11_bit         _BIT_ACCESS(AT1CC1L,1)
// AT1CC1L<AT1CC12>
extern volatile __bit                   AT1CC12             __at(0x447A);	// @ (0x88F * 8 + 2)
#define                                 AT1CC12_bit         _BIT_ACCESS(AT1CC1L,2)
// AT1CC1L<AT1CC13>
extern volatile __bit                   AT1CC13             __at(0x447B);	// @ (0x88F * 8 + 3)
#define                                 AT1CC13_bit         _BIT_ACCESS(AT1CC1L,3)
// AT1CC1L<AT1CC14>
extern volatile __bit                   AT1CC14             __at(0x447C);	// @ (0x88F * 8 + 4)
#define                                 AT1CC14_bit         _BIT_ACCESS(AT1CC1L,4)
// AT1CC1L<AT1CC15>
extern volatile __bit                   AT1CC15             __at(0x447D);	// @ (0x88F * 8 + 5)
#define                                 AT1CC15_bit         _BIT_ACCESS(AT1CC1L,5)
// AT1CC1L<AT1CC16>
extern volatile __bit                   AT1CC16             __at(0x447E);	// @ (0x88F * 8 + 6)
#define                                 AT1CC16_bit         _BIT_ACCESS(AT1CC1L,6)
// AT1CC1L<AT1CC17>
extern volatile __bit                   AT1CC17             __at(0x447F);	// @ (0x88F * 8 + 7)
#define                                 AT1CC17_bit         _BIT_ACCESS(AT1CC1L,7)
// AT1CC1H<AT1CC18>
extern volatile __bit                   AT1CC18             __at(0x4480);	// @ (0x890 * 8 + 0)
#define                                 AT1CC18_bit         _BIT_ACCESS(AT1CC1H,0)
// AT1CC1H<AT1CC19>
extern volatile __bit                   AT1CC19             __at(0x4481);	// @ (0x890 * 8 + 1)
#define                                 AT1CC19_bit         _BIT_ACCESS(AT1CC1H,1)
// AT1CCON1<AT1CC1EN>
extern volatile __bit                   AT1CC1EN            __at(0x448F);	// @ (0x891 * 8 + 7)
#define                                 AT1CC1EN_bit        _BIT_ACCESS(AT1CCON1,7)
// AT1IE1<AT1CC1IE>
extern volatile __bit                   AT1CC1IE            __at(0x40C8);	// @ (0x819 * 8 + 0)
#define                                 AT1CC1IE_bit        _BIT_ACCESS(AT1IE1,0)
// AT1IR1<AT1CC1IF>
extern volatile __bit                   AT1CC1IF            __at(0x40C0);	// @ (0x818 * 8 + 0)
#define                                 AT1CC1IF_bit        _BIT_ACCESS(AT1IR1,0)
// AT1CCON1<AT1CC1MODE>
extern volatile __bit                   AT1CC1MODE          __at(0x4488);	// @ (0x891 * 8 + 0)
#define                                 AT1CC1MODE_bit      _BIT_ACCESS(AT1CCON1,0)
// AT1CCON1<AT1CC1POL>
extern volatile __bit                   AT1CC1POL           __at(0x448C);	// @ (0x891 * 8 + 4)
#define                                 AT1CC1POL_bit       _BIT_ACCESS(AT1CCON1,4)
// AT1CC2L<AT1CC20>
extern volatile __bit                   AT1CC20             __at(0x4498);	// @ (0x893 * 8 + 0)
#define                                 AT1CC20_bit         _BIT_ACCESS(AT1CC2L,0)
// AT1CC2L<AT1CC21>
extern volatile __bit                   AT1CC21             __at(0x4499);	// @ (0x893 * 8 + 1)
#define                                 AT1CC21_bit         _BIT_ACCESS(AT1CC2L,1)
// AT1CC2L<AT1CC22>
extern volatile __bit                   AT1CC22             __at(0x449A);	// @ (0x893 * 8 + 2)
#define                                 AT1CC22_bit         _BIT_ACCESS(AT1CC2L,2)
// AT1CC2L<AT1CC23>
extern volatile __bit                   AT1CC23             __at(0x449B);	// @ (0x893 * 8 + 3)
#define                                 AT1CC23_bit         _BIT_ACCESS(AT1CC2L,3)
// AT1CC2L<AT1CC24>
extern volatile __bit                   AT1CC24             __at(0x449C);	// @ (0x893 * 8 + 4)
#define                                 AT1CC24_bit         _BIT_ACCESS(AT1CC2L,4)
// AT1CC2L<AT1CC25>
extern volatile __bit                   AT1CC25             __at(0x449D);	// @ (0x893 * 8 + 5)
#define                                 AT1CC25_bit         _BIT_ACCESS(AT1CC2L,5)
// AT1CC2L<AT1CC26>
extern volatile __bit                   AT1CC26             __at(0x449E);	// @ (0x893 * 8 + 6)
#define                                 AT1CC26_bit         _BIT_ACCESS(AT1CC2L,6)
// AT1CC2L<AT1CC27>
extern volatile __bit                   AT1CC27             __at(0x449F);	// @ (0x893 * 8 + 7)
#define                                 AT1CC27_bit         _BIT_ACCESS(AT1CC2L,7)
// AT1CC2H<AT1CC28>
extern volatile __bit                   AT1CC28             __at(0x44A0);	// @ (0x894 * 8 + 0)
#define                                 AT1CC28_bit         _BIT_ACCESS(AT1CC2H,0)
// AT1CC2H<AT1CC29>
extern volatile __bit                   AT1CC29             __at(0x44A1);	// @ (0x894 * 8 + 1)
#define                                 AT1CC29_bit         _BIT_ACCESS(AT1CC2H,1)
// AT1CCON2<AT1CC2EN>
extern volatile __bit                   AT1CC2EN            __at(0x44AF);	// @ (0x895 * 8 + 7)
#define                                 AT1CC2EN_bit        _BIT_ACCESS(AT1CCON2,7)
// AT1IE1<AT1CC2IE>
extern volatile __bit                   AT1CC2IE            __at(0x40C9);	// @ (0x819 * 8 + 1)
#define                                 AT1CC2IE_bit        _BIT_ACCESS(AT1IE1,1)
// AT1IR1<AT1CC2IF>
extern volatile __bit                   AT1CC2IF            __at(0x40C1);	// @ (0x818 * 8 + 1)
#define                                 AT1CC2IF_bit        _BIT_ACCESS(AT1IR1,1)
// AT1CCON2<AT1CC2MODE>
extern volatile __bit                   AT1CC2MODE          __at(0x44A8);	// @ (0x895 * 8 + 0)
#define                                 AT1CC2MODE_bit      _BIT_ACCESS(AT1CCON2,0)
// AT1CCON2<AT1CC2POL>
extern volatile __bit                   AT1CC2POL           __at(0x44AC);	// @ (0x895 * 8 + 4)
#define                                 AT1CC2POL_bit       _BIT_ACCESS(AT1CCON2,4)
// AT1CC3L<AT1CC30>
extern volatile __bit                   AT1CC30             __at(0x44B8);	// @ (0x897 * 8 + 0)
#define                                 AT1CC30_bit         _BIT_ACCESS(AT1CC3L,0)
// AT1CC3L<AT1CC31>
extern volatile __bit                   AT1CC31             __at(0x44B9);	// @ (0x897 * 8 + 1)
#define                                 AT1CC31_bit         _BIT_ACCESS(AT1CC3L,1)
// AT1CC3L<AT1CC32>
extern volatile __bit                   AT1CC32             __at(0x44BA);	// @ (0x897 * 8 + 2)
#define                                 AT1CC32_bit         _BIT_ACCESS(AT1CC3L,2)
// AT1CC3L<AT1CC33>
extern volatile __bit                   AT1CC33             __at(0x44BB);	// @ (0x897 * 8 + 3)
#define                                 AT1CC33_bit         _BIT_ACCESS(AT1CC3L,3)
// AT1CC3L<AT1CC34>
extern volatile __bit                   AT1CC34             __at(0x44BC);	// @ (0x897 * 8 + 4)
#define                                 AT1CC34_bit         _BIT_ACCESS(AT1CC3L,4)
// AT1CC3L<AT1CC35>
extern volatile __bit                   AT1CC35             __at(0x44BD);	// @ (0x897 * 8 + 5)
#define                                 AT1CC35_bit         _BIT_ACCESS(AT1CC3L,5)
// AT1CC3L<AT1CC36>
extern volatile __bit                   AT1CC36             __at(0x44BE);	// @ (0x897 * 8 + 6)
#define                                 AT1CC36_bit         _BIT_ACCESS(AT1CC3L,6)
// AT1CC3L<AT1CC37>
extern volatile __bit                   AT1CC37             __at(0x44BF);	// @ (0x897 * 8 + 7)
#define                                 AT1CC37_bit         _BIT_ACCESS(AT1CC3L,7)
// AT1CC3H<AT1CC38>
extern volatile __bit                   AT1CC38             __at(0x44C0);	// @ (0x898 * 8 + 0)
#define                                 AT1CC38_bit         _BIT_ACCESS(AT1CC3H,0)
// AT1CC3H<AT1CC39>
extern volatile __bit                   AT1CC39             __at(0x44C1);	// @ (0x898 * 8 + 1)
#define                                 AT1CC39_bit         _BIT_ACCESS(AT1CC3H,1)
// AT1CCON3<AT1CC3EN>
extern volatile __bit                   AT1CC3EN            __at(0x44CF);	// @ (0x899 * 8 + 7)
#define                                 AT1CC3EN_bit        _BIT_ACCESS(AT1CCON3,7)
// AT1IE1<AT1CC3IE>
extern volatile __bit                   AT1CC3IE            __at(0x40CA);	// @ (0x819 * 8 + 2)
#define                                 AT1CC3IE_bit        _BIT_ACCESS(AT1IE1,2)
// AT1IR1<AT1CC3IF>
extern volatile __bit                   AT1CC3IF            __at(0x40C2);	// @ (0x818 * 8 + 2)
#define                                 AT1CC3IF_bit        _BIT_ACCESS(AT1IR1,2)
// AT1CCON3<AT1CC3MODE>
extern volatile __bit                   AT1CC3MODE          __at(0x44C8);	// @ (0x899 * 8 + 0)
#define                                 AT1CC3MODE_bit      _BIT_ACCESS(AT1CCON3,0)
// AT1CCON3<AT1CC3POL>
extern volatile __bit                   AT1CC3POL           __at(0x44CC);	// @ (0x899 * 8 + 4)
#define                                 AT1CC3POL_bit       _BIT_ACCESS(AT1CCON3,4)
// AT1CSEL1<AT1CP1S0>
extern volatile __bit                   AT1CP1S0            __at(0x4470);	// @ (0x88E * 8 + 0)
#define                                 AT1CP1S0_bit        _BIT_ACCESS(AT1CSEL1,0)
// AT1CSEL1<AT1CP1S1>
extern volatile __bit                   AT1CP1S1            __at(0x4471);	// @ (0x88E * 8 + 1)
#define                                 AT1CP1S1_bit        _BIT_ACCESS(AT1CSEL1,1)
// AT1CSEL1<AT1CP1S2>
extern volatile __bit                   AT1CP1S2            __at(0x4472);	// @ (0x88E * 8 + 2)
#define                                 AT1CP1S2_bit        _BIT_ACCESS(AT1CSEL1,2)
// AT1CSEL2<AT1CP2S0>
extern volatile __bit                   AT1CP2S0            __at(0x4490);	// @ (0x892 * 8 + 0)
#define                                 AT1CP2S0_bit        _BIT_ACCESS(AT1CSEL2,0)
// AT1CSEL2<AT1CP2S1>
extern volatile __bit                   AT1CP2S1            __at(0x4491);	// @ (0x892 * 8 + 1)
#define                                 AT1CP2S1_bit        _BIT_ACCESS(AT1CSEL2,1)
// AT1CSEL2<AT1CP2S2>
extern volatile __bit                   AT1CP2S2            __at(0x4492);	// @ (0x892 * 8 + 2)
#define                                 AT1CP2S2_bit        _BIT_ACCESS(AT1CSEL2,2)
// AT1CSEL3<AT1CP3S0>
extern volatile __bit                   AT1CP3S0            __at(0x44B0);	// @ (0x896 * 8 + 0)
#define                                 AT1CP3S0_bit        _BIT_ACCESS(AT1CSEL3,0)
// AT1CSEL3<AT1CP3S1>
extern volatile __bit                   AT1CP3S1            __at(0x44B1);	// @ (0x896 * 8 + 1)
#define                                 AT1CP3S1_bit        _BIT_ACCESS(AT1CSEL3,1)
// AT1CSEL3<AT1CP3S2>
extern volatile __bit                   AT1CP3S2            __at(0x44B2);	// @ (0x896 * 8 + 2)
#define                                 AT1CP3S2_bit        _BIT_ACCESS(AT1CSEL3,2)
// AT1CLK<AT1CS>
extern volatile __bit                   AT1CS               __at(0x4460);	// @ (0x88C * 8 + 0)
#define                                 AT1CS_bit           _BIT_ACCESS(AT1CLK,0)
// AT1CLK<AT1CS0>
extern volatile __bit                   AT1CS0              __at(0x4460);	// @ (0x88C * 8 + 0)
#define                                 AT1CS0_bit          _BIT_ACCESS(AT1CLK,0)
// AT1CON0<AT1EN>
extern volatile __bit                   AT1EN               __at(0x40A7);	// @ (0x814 * 8 + 7)
#define                                 AT1EN_bit           _BIT_ACCESS(AT1CON0,7)
// AT1ERRL<AT1ERR0>
