MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1615/mcu.h
extern volatile __bit                   DBR2                __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<DBR5>
extern volatile __bit                   DBR5                __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(CWG1DBR,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x10B8);	// @ (0x217 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// CRCCON1<DLEN0>
extern volatile __bit                   DLEN0               __at(0x3CD4);	// @ (0x79A * 8 + 4)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON1,4)
// CRCCON1<DLEN1>
extern volatile __bit                   DLEN1               __at(0x3CD5);	// @ (0x79A * 8 + 5)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON1,5)
// CRCCON1<DLEN2>
extern volatile __bit                   DLEN2               __at(0x3CD6);	// @ (0x79A * 8 + 6)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON1,6)
// CRCCON1<DLEN3>
extern volatile __bit                   DLEN3               __at(0x3CD7);	// @ (0x79A * 8 + 7)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON1,7)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x10A5);	// @ (0x214 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// AT1ERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x40E0);	// @ (0x81C * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(AT1ERRL,0)
// AT1ERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x40E1);	// @ (0x81C * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(AT1ERRL,1)
// AT1ERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x40EA);	// @ (0x81D * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(AT1ERRH,2)
// AT1ERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x40EB);	// @ (0x81D * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(AT1ERRH,3)
// AT1ERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x40EC);	// @ (0x81D * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(AT1ERRH,4)
// AT1ERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x40ED);	// @ (0x81D * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(AT1ERRH,5)
// AT1ERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x40EE);	// @ (0x81D * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(AT1ERRH,6)
// AT1ERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x40EF);	// @ (0x81D * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(AT1ERRH,7)
// AT1ERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x40E2);	// @ (0x81C * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(AT1ERRL,2)
// AT1ERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x40E3);	// @ (0x81C * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(AT1ERRL,3)
// AT1ERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x40E4);	// @ (0x81C * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(AT1ERRL,4)
// AT1ERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x40E5);	// @ (0x81C * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(AT1ERRL,5)
// AT1ERRL<ERR6>
extern volatile __bit                   ERR6                __at(0x40E6);	// @ (0x81C * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(AT1ERRL,6)
// AT1ERRL<ERR7>
extern volatile __bit                   ERR7                __at(0x40E7);	// @ (0x81C * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(AT1ERRL,7)
// AT1ERRH<ERR8>
extern volatile __bit                   ERR8                __at(0x40E8);	// @ (0x81D * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(AT1ERRH,0)
// AT1ERRH<ERR9>
extern volatile __bit                   ERR9                __at(0x40E9);	// @ (0x81D * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(AT1ERRH,1)
// AT1ERRH<ERRH0>
extern volatile __bit                   ERRH0               __at(0x40E8);	// @ (0x81D * 8 + 0)
#define                                 ERRH0_bit           _BIT_ACCESS(AT1ERRH,0)
// AT1ERRH<ERRH1>
extern volatile __bit                   ERRH1               __at(0x40E9);	// @ (0x81D * 8 + 1)
#define                                 ERRH1_bit           _BIT_ACCESS(AT1ERRH,1)
// AT1ERRH<ERRH2>
extern volatile __bit                   ERRH2               __at(0x40EA);	// @ (0x81D * 8 + 2)
#define                                 ERRH2_bit           _BIT_ACCESS(AT1ERRH,2)
// AT1ERRH<ERRH3>
extern volatile __bit                   ERRH3               __at(0x40EB);	// @ (0x81D * 8 + 3)
#define                                 ERRH3_bit           _BIT_ACCESS(AT1ERRH,3)
// AT1ERRH<ERRH4>
extern volatile __bit                   ERRH4               __at(0x40EC);	// @ (0x81D * 8 + 4)
#define                                 ERRH4_bit           _BIT_ACCESS(AT1ERRH,4)
// AT1ERRH<ERRH5>
extern volatile __bit                   ERRH5               __at(0x40ED);	// @ (0x81D * 8 + 5)
#define                                 ERRH5_bit           _BIT_ACCESS(AT1ERRH,5)
// AT1ERRH<ERRH6>
extern volatile __bit                   ERRH6               __at(0x40EE);	// @ (0x81D * 8 + 6)
#define                                 ERRH6_bit           _BIT_ACCESS(AT1ERRH,6)
// AT1ERRH<ERRH7>
extern volatile __bit                   ERRH7               __at(0x40EF);	// @ (0x81D * 8 + 7)
#define                                 ERRH7_bit           _BIT_ACCESS(AT1ERRH,7)
// AT1ERRL<ERRL0>
extern volatile __bit                   ERRL0               __at(0x40E0);	// @ (0x81C * 8 + 0)
#define                                 ERRL0_bit           _BIT_ACCESS(AT1ERRL,0)
// AT1ERRL<ERRL1>
extern volatile __bit                   ERRL1               __at(0x40E1);	// @ (0x81C * 8 + 1)
#define                                 ERRL1_bit           _BIT_ACCESS(AT1ERRL,1)
// AT1ERRL<ERRL2>
extern volatile __bit                   ERRL2               __at(0x40E2);	// @ (0x81C * 8 + 2)
#define                                 ERRL2_bit           _BIT_ACCESS(AT1ERRL,2)
// AT1ERRL<ERRL3>
extern volatile __bit                   ERRL3               __at(0x40E3);	// @ (0x81C * 8 + 3)
#define                                 ERRL3_bit           _BIT_ACCESS(AT1ERRL,3)
// AT1ERRL<ERRL4>
extern volatile __bit                   ERRL4               __at(0x40E4);	// @ (0x81C * 8 + 4)
#define                                 ERRL4_bit           _BIT_ACCESS(AT1ERRL,4)
// AT1ERRL<ERRL5>
extern volatile __bit                   ERRL5               __at(0x40E5);	// @ (0x81C * 8 + 5)
#define                                 ERRL5_bit           _BIT_ACCESS(AT1ERRL,5)
// AT1ERRL<ERRL6>
extern volatile __bit                   ERRL6               __at(0x40E6);	// @ (0x81C * 8 + 6)
#define                                 ERRL6_bit           _BIT_ACCESS(AT1ERRL,6)
// AT1ERRL<ERRL7>
extern volatile __bit                   ERRL7               __at(0x40E7);	// @ (0x81C * 8 + 7)
#define                                 ERRL7_bit           _BIT_ACCESS(AT1ERRL,7)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// PMCON1<FREE>
extern volatile __bit                   FREE                __at(0xCAC);	// @ (0x195 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(PMCON1,4)
// CRCCON0<FULL>
extern volatile __bit                   FULL                __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 FULL_bit            _BIT_ACCESS(CRCCON0,0)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x8BF);	// @ (0x117 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x8BE);	// @ (0x117 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x34B7);	// @ (0x696 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// SSP1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0x10B7);	// @ (0x216 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// SCANHADRL<HADR0>
extern volatile __bit                   HADR0               __at(0x38D0);	// @ (0x71A * 8 + 0)
#define                                 HADR0_bit           _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<HADR1>
extern volatile __bit                   HADR1               __at(0x38D1);	// @ (0x71A * 8 + 1)
#define                                 HADR1_bit           _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<HADR10>
extern volatile __bit                   HADR10              __at(0x38DA);	// @ (0x71B * 8 + 2)
#define                                 HADR10_bit          _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<HADR11>
extern volatile __bit                   HADR11              __at(0x38DB);	// @ (0x71B * 8 + 3)
#define                                 HADR11_bit          _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<HADR12>
extern volatile __bit                   HADR12              __at(0x38DC);	// @ (0x71B * 8 + 4)
#define                                 HADR12_bit          _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<HADR13>
extern volatile __bit                   HADR13              __at(0x38DD);	// @ (0x71B * 8 + 5)
#define                                 HADR13_bit          _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<HADR14>
extern volatile __bit                   HADR14              __at(0x38DE);	// @ (0x71B * 8 + 6)
#define                                 HADR14_bit          _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<HADR15>
extern volatile __bit                   HADR15              __at(0x38DF);	// @ (0x71B * 8 + 7)
#define                                 HADR15_bit          _BIT_ACCESS(SCANHADRH,7)
// SCANHADRL<HADR3>
extern volatile __bit                   HADR3               __at(0x38D3);	// @ (0x71A * 8 + 3)
#define                                 HADR3_bit           _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<HADR4>
extern volatile __bit                   HADR4               __at(0x38D4);	// @ (0x71A * 8 + 4)
#define                                 HADR4_bit           _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<HADR5>
extern volatile __bit                   HADR5               __at(0x38D5);	// @ (0x71A * 8 + 5)
#define                                 HADR5_bit           _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<HADR6>
extern volatile __bit                   HADR6               __at(0x38D6);	// @ (0x71A * 8 + 6)
#define                                 HADR6_bit           _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<HADR7>
extern volatile __bit                   HADR7               __at(0x38D7);	// @ (0x71A * 8 + 7)
#define                                 HADR7_bit           _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<HADR8>
extern volatile __bit                   HADR8               __at(0x38D8);	// @ (0x71B * 8 + 0)
#define                                 HADR8_bit           _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<HADR9>
extern volatile __bit                   HADR9               __at(0x38D9);	// @ (0x71B * 8 + 1)
#define                                 HADR9_bit           _BIT_ACCESS(SCANHADRH,1)
// SCANHADRL<HARD2>
extern volatile __bit                   HARD2               __at(0x38D2);	// @ (0x71A * 8 + 2)
#define                                 HARD2_bit           _BIT_ACCESS(SCANHADRL,2)
// OSCSTAT<HFIOFL>
extern volatile __bit                   HFIOFL              __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 HFIOFL_bit          _BIT_ACCESS(OSCSTAT,3)
// OSCSTAT<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCSTAT,4)
// OSCSTAT<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCSTAT,0)
// HIDRVC<HIDC4>
extern volatile __bit                   HIDC4               __at(0x2074);	// @ (0x40E * 8 + 4)
#define                                 HIDC4_bit           _BIT_ACCESS(HIDRVC,4)
// HIDRVC<HIDC5>
extern volatile __bit                   HIDC5               __at(0x2075);	// @ (0x40E * 8 + 5)
#define                                 HIDC5_bit           _BIT_ACCESS(HIDRVC,5)
// CWG1CON1<IN>
extern volatile __bit                   IN                  __at(0x34BD);	// @ (0x697 * 8 + 5)
#define                                 IN_bit              _BIT_ACCESS(CWG1CON1,5)
// PID1INL<IN0>
extern volatile __bit                   IN0                 __at(0x2C70);	// @ (0x58E * 8 + 0)
#define                                 IN0_bit             _BIT_ACCESS(PID1INL,0)
// PID1INL<IN1>
extern volatile __bit                   IN1                 __at(0x2C71);	// @ (0x58E * 8 + 1)
#define                                 IN1_bit             _BIT_ACCESS(PID1INL,1)
// PID1INH<IN10>
extern volatile __bit                   IN10                __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 IN10_bit            _BIT_ACCESS(PID1INH,2)
// PID1INH<IN11>
extern volatile __bit                   IN11                __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 IN11_bit            _BIT_ACCESS(PID1INH,3)
// PID1INH<IN12>
extern volatile __bit                   IN12                __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 IN12_bit            _BIT_ACCESS(PID1INH,4)
// PID1INH<IN13>
extern volatile __bit                   IN13                __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 IN13_bit            _BIT_ACCESS(PID1INH,5)
// PID1INH<IN14>
extern volatile __bit                   IN14                __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 IN14_bit            _BIT_ACCESS(PID1INH,6)
// PID1INH<IN15>
extern volatile __bit                   IN15                __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 IN15_bit            _BIT_ACCESS(PID1INH,7)
// PID1INL<IN2>
extern volatile __bit                   IN2                 __at(0x2C72);	// @ (0x58E * 8 + 2)
#define                                 IN2_bit             _BIT_ACCESS(PID1INL,2)
// PID1INL<IN3>
extern volatile __bit                   IN3                 __at(0x2C73);	// @ (0x58E * 8 + 3)
#define                                 IN3_bit             _BIT_ACCESS(PID1INL,3)
// PID1INL<IN4>
extern volatile __bit                   IN4                 __at(0x2C74);	// @ (0x58E * 8 + 4)
#define                                 IN4_bit             _BIT_ACCESS(PID1INL,4)
// PID1INL<IN5>
extern volatile __bit                   IN5                 __at(0x2C75);	// @ (0x58E * 8 + 5)
#define                                 IN5_bit             _BIT_ACCESS(PID1INL,5)
// PID1INL<IN6>
extern volatile __bit                   IN6                 __at(0x2C76);	// @ (0x58E * 8 + 6)
#define                                 IN6_bit             _BIT_ACCESS(PID1INL,6)
// PID1INL<IN7>
extern volatile __bit                   IN7                 __at(0x2C77);	// @ (0x58E * 8 + 7)
#define                                 IN7_bit             _BIT_ACCESS(PID1INL,7)
// PID1INH<IN8>
extern volatile __bit                   IN8                 __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 IN8_bit             _BIT_ACCESS(PID1INH,0)
// PID1INH<IN9>
extern volatile __bit                   IN9                 __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 IN9_bit             _BIT_ACCESS(PID1INH,1)
// CWG1AS1<INAS>
extern volatile __bit                   INAS                __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 INAS_bit            _BIT_ACCESS(CWG1AS1,0)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x1C60);	// @ (0x38C * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x1C61);	// @ (0x38C * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x1C62);	// @ (0x38C * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x1C63);	// @ (0x38C * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x1C64);	// @ (0x38C * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x1C65);	// @ (0x38C * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x1C70);	// @ (0x38E * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x1C71);	// @ (0x38E * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x1C72);	// @ (0x38E * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x1C73);	// @ (0x38E * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x1C74);	// @ (0x38E * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x1C75);	// @ (0x38E * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// SCANCON0<INTM>
extern volatile __bit                   INTM                __at(0x38E3);	// @ (0x71C * 8 + 3)
#define                                 INTM_bit            _BIT_ACCESS(SCANCON0,3)
// INTPPS<INTPPS0>
extern volatile __bit                   INTPPS0             __at(0x7080);	// @ (0xE10 * 8 + 0)
#define                                 INTPPS0_bit         _BIT_ACCESS(INTPPS,0)
// INTPPS<INTPPS1>
extern volatile __bit                   INTPPS1             __at(0x7081);	// @ (0xE10 * 8 + 1)
#define                                 INTPPS1_bit         _BIT_ACCESS(INTPPS,1)
// INTPPS<INTPPS2>
extern volatile __bit                   INTPPS2             __at(0x7082);	// @ (0xE10 * 8 + 2)
#define                                 INTPPS2_bit         _BIT_ACCESS(INTPPS,2)
// INTPPS<INTPPS3>
extern volatile __bit                   INTPPS3             __at(0x7083);	// @ (0xE10 * 8 + 3)
#define                                 INTPPS3_bit         _BIT_ACCESS(INTPPS,3)
// INTPPS<INTPPS4>
extern volatile __bit                   INTPPS4             __at(0x7084);	// @ (0xE10 * 8 + 4)
#define                                 INTPPS4_bit         _BIT_ACCESS(INTPPS,4)
// SCANCON0<INVALID>
extern volatile __bit                   INVALID             __at(0x38E4);	// @ (0x71C * 8 + 4)
#define                                 INVALID_bit         _BIT_ACCESS(SCANCON0,4)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x1C98);	// @ (0x393 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x1C99);	// @ (0x393 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x1C9A);	// @ (0x393 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x1C9B);	// @ (0x393 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x1C9C);	// @ (0x393 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x1C9D);	// @ (0x393 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x1C90);	// @ (0x392 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x1C91);	// @ (0x392 * 8 + 1)
