MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1615/mcu.h
extern volatile __bit                   LC4G2D4N            __at(0x79AE);	// @ (0xF35 * 8 + 6)
#define                                 LC4G2D4N_bit        _BIT_ACCESS(CLC4GLS1,6)
// CLC4GLS1<LC4G2D4T>
extern volatile __bit                   LC4G2D4T            __at(0x79AF);	// @ (0xF35 * 8 + 7)
#define                                 LC4G2D4T_bit        _BIT_ACCESS(CLC4GLS1,7)
// CLC4POL<LC4G2POL>
extern volatile __bit                   LC4G2POL            __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 LC4G2POL_bit        _BIT_ACCESS(CLC4POL,1)
// CLC4GLS2<LC4G3D1N>
extern volatile __bit                   LC4G3D1N            __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 LC4G3D1N_bit        _BIT_ACCESS(CLC4GLS2,0)
// CLC4GLS2<LC4G3D1T>
extern volatile __bit                   LC4G3D1T            __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 LC4G3D1T_bit        _BIT_ACCESS(CLC4GLS2,1)
// CLC4GLS2<LC4G3D2N>
extern volatile __bit                   LC4G3D2N            __at(0x79B2);	// @ (0xF36 * 8 + 2)
#define                                 LC4G3D2N_bit        _BIT_ACCESS(CLC4GLS2,2)
// CLC4GLS2<LC4G3D2T>
extern volatile __bit                   LC4G3D2T            __at(0x79B3);	// @ (0xF36 * 8 + 3)
#define                                 LC4G3D2T_bit        _BIT_ACCESS(CLC4GLS2,3)
// CLC4GLS2<LC4G3D3N>
extern volatile __bit                   LC4G3D3N            __at(0x79B4);	// @ (0xF36 * 8 + 4)
#define                                 LC4G3D3N_bit        _BIT_ACCESS(CLC4GLS2,4)
// CLC4GLS2<LC4G3D3T>
extern volatile __bit                   LC4G3D3T            __at(0x79B5);	// @ (0xF36 * 8 + 5)
#define                                 LC4G3D3T_bit        _BIT_ACCESS(CLC4GLS2,5)
// CLC4GLS2<LC4G3D4N>
extern volatile __bit                   LC4G3D4N            __at(0x79B6);	// @ (0xF36 * 8 + 6)
#define                                 LC4G3D4N_bit        _BIT_ACCESS(CLC4GLS2,6)
// CLC4GLS2<LC4G3D4T>
extern volatile __bit                   LC4G3D4T            __at(0x79B7);	// @ (0xF36 * 8 + 7)
#define                                 LC4G3D4T_bit        _BIT_ACCESS(CLC4GLS2,7)
// CLC4POL<LC4G3POL>
extern volatile __bit                   LC4G3POL            __at(0x797A);	// @ (0xF2F * 8 + 2)
#define                                 LC4G3POL_bit        _BIT_ACCESS(CLC4POL,2)
// CLC4GLS3<LC4G4D1N>
extern volatile __bit                   LC4G4D1N            __at(0x79B8);	// @ (0xF37 * 8 + 0)
#define                                 LC4G4D1N_bit        _BIT_ACCESS(CLC4GLS3,0)
// CLC4GLS3<LC4G4D1T>
extern volatile __bit                   LC4G4D1T            __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 LC4G4D1T_bit        _BIT_ACCESS(CLC4GLS3,1)
// CLC4GLS3<LC4G4D2N>
extern volatile __bit                   LC4G4D2N            __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 LC4G4D2N_bit        _BIT_ACCESS(CLC4GLS3,2)
// CLC4GLS3<LC4G4D2T>
extern volatile __bit                   LC4G4D2T            __at(0x79BB);	// @ (0xF37 * 8 + 3)
#define                                 LC4G4D2T_bit        _BIT_ACCESS(CLC4GLS3,3)
// CLC4GLS3<LC4G4D3N>
extern volatile __bit                   LC4G4D3N            __at(0x79BC);	// @ (0xF37 * 8 + 4)
#define                                 LC4G4D3N_bit        _BIT_ACCESS(CLC4GLS3,4)
// CLC4GLS3<LC4G4D3T>
extern volatile __bit                   LC4G4D3T            __at(0x79BD);	// @ (0xF37 * 8 + 5)
#define                                 LC4G4D3T_bit        _BIT_ACCESS(CLC4GLS3,5)
// CLC4GLS3<LC4G4D4N>
extern volatile __bit                   LC4G4D4N            __at(0x79BE);	// @ (0xF37 * 8 + 6)
#define                                 LC4G4D4N_bit        _BIT_ACCESS(CLC4GLS3,6)
// CLC4GLS3<LC4G4D4T>
extern volatile __bit                   LC4G4D4T            __at(0x79BF);	// @ (0xF37 * 8 + 7)
#define                                 LC4G4D4T_bit        _BIT_ACCESS(CLC4GLS3,7)
// CLC4POL<LC4G4POL>
extern volatile __bit                   LC4G4POL            __at(0x797B);	// @ (0xF2F * 8 + 3)
#define                                 LC4G4POL_bit        _BIT_ACCESS(CLC4POL,3)
// CLC4CON<LC4INTN>
extern volatile __bit                   LC4INTN             __at(0x7973);	// @ (0xF2E * 8 + 3)
#define                                 LC4INTN_bit         _BIT_ACCESS(CLC4CON,3)
// CLC4CON<LC4INTP>
extern volatile __bit                   LC4INTP             __at(0x7974);	// @ (0xF2E * 8 + 4)
#define                                 LC4INTP_bit         _BIT_ACCESS(CLC4CON,4)
// CLC4CON<LC4MODE0>
extern volatile __bit                   LC4MODE0            __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 LC4MODE0_bit        _BIT_ACCESS(CLC4CON,0)
// CLC4CON<LC4MODE1>
extern volatile __bit                   LC4MODE1            __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 LC4MODE1_bit        _BIT_ACCESS(CLC4CON,1)
// CLC4CON<LC4MODE2>
extern volatile __bit                   LC4MODE2            __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 LC4MODE2_bit        _BIT_ACCESS(CLC4CON,2)
// CLC4CON<LC4OUT>
extern volatile __bit                   LC4OUT              __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 LC4OUT_bit          _BIT_ACCESS(CLC4CON,5)
// CLC4POL<LC4POL>
extern volatile __bit                   LC4POL              __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 LC4POL_bit          _BIT_ACCESS(CLC4POL,7)
// CWG1CON0<LD>
extern volatile __bit                   LD                  __at(0x34B6);	// @ (0x696 * 8 + 6)
#define                                 LD_bit              _BIT_ACCESS(CWG1CON0,6)
// SCANLADRL<LDAR0>
extern volatile __bit                   LDAR0               __at(0x38C0);	// @ (0x718 * 8 + 0)
#define                                 LDAR0_bit           _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<LDAR1>
extern volatile __bit                   LDAR1               __at(0x38C1);	// @ (0x718 * 8 + 1)
#define                                 LDAR1_bit           _BIT_ACCESS(SCANLADRL,1)
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 LFIOFR_bit          _BIT_ACCESS(OSCSTAT,1)
// CWG1AS0<LSAC0>
extern volatile __bit                   LSAC0               __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 LSAC0_bit           _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<LSAC1>
extern volatile __bit                   LSAC1               __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 LSAC1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSBD0>
extern volatile __bit                   LSBD0               __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 LSBD0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSBD1>
extern volatile __bit                   LSBD1               __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 LSBD1_bit           _BIT_ACCESS(CWG1AS0,5)
// PMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(PMCON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// AT1MISSL<MISS0>
extern volatile __bit                   MISS0               __at(0x4070);	// @ (0x80E * 8 + 0)
#define                                 MISS0_bit           _BIT_ACCESS(AT1MISSL,0)
// AT1MISSL<MISS1>
extern volatile __bit                   MISS1               __at(0x4071);	// @ (0x80E * 8 + 1)
#define                                 MISS1_bit           _BIT_ACCESS(AT1MISSL,1)
// AT1MISSH<MISS10>
extern volatile __bit                   MISS10              __at(0x407A);	// @ (0x80F * 8 + 2)
#define                                 MISS10_bit          _BIT_ACCESS(AT1MISSH,2)
// AT1MISSH<MISS11>
extern volatile __bit                   MISS11              __at(0x407B);	// @ (0x80F * 8 + 3)
#define                                 MISS11_bit          _BIT_ACCESS(AT1MISSH,3)
// AT1MISSH<MISS12>
extern volatile __bit                   MISS12              __at(0x407C);	// @ (0x80F * 8 + 4)
#define                                 MISS12_bit          _BIT_ACCESS(AT1MISSH,4)
// AT1MISSH<MISS13>
extern volatile __bit                   MISS13              __at(0x407D);	// @ (0x80F * 8 + 5)
#define                                 MISS13_bit          _BIT_ACCESS(AT1MISSH,5)
// AT1MISSH<MISS14>
extern volatile __bit                   MISS14              __at(0x407E);	// @ (0x80F * 8 + 6)
#define                                 MISS14_bit          _BIT_ACCESS(AT1MISSH,6)
// AT1MISSH<MISS15>
extern volatile __bit                   MISS15              __at(0x407F);	// @ (0x80F * 8 + 7)
#define                                 MISS15_bit          _BIT_ACCESS(AT1MISSH,7)
// AT1MISSL<MISS2>
extern volatile __bit                   MISS2               __at(0x4072);	// @ (0x80E * 8 + 2)
#define                                 MISS2_bit           _BIT_ACCESS(AT1MISSL,2)
// AT1MISSL<MISS3>
extern volatile __bit                   MISS3               __at(0x4073);	// @ (0x80E * 8 + 3)
#define                                 MISS3_bit           _BIT_ACCESS(AT1MISSL,3)
// AT1MISSL<MISS4>
extern volatile __bit                   MISS4               __at(0x4074);	// @ (0x80E * 8 + 4)
#define                                 MISS4_bit           _BIT_ACCESS(AT1MISSL,4)
// AT1MISSL<MISS5>
extern volatile __bit                   MISS5               __at(0x4075);	// @ (0x80E * 8 + 5)
#define                                 MISS5_bit           _BIT_ACCESS(AT1MISSL,5)
// AT1MISSL<MISS6>
extern volatile __bit                   MISS6               __at(0x4076);	// @ (0x80E * 8 + 6)
#define                                 MISS6_bit           _BIT_ACCESS(AT1MISSL,6)
// AT1MISSL<MISS7>
extern volatile __bit                   MISS7               __at(0x4077);	// @ (0x80E * 8 + 7)
#define                                 MISS7_bit           _BIT_ACCESS(AT1MISSL,7)
// AT1MISSH<MISS8>
extern volatile __bit                   MISS8               __at(0x4078);	// @ (0x80F * 8 + 0)
#define                                 MISS8_bit           _BIT_ACCESS(AT1MISSH,0)
// AT1MISSH<MISS9>
extern volatile __bit                   MISS9               __at(0x4079);	// @ (0x80F * 8 + 1)
#define                                 MISS9_bit           _BIT_ACCESS(AT1MISSH,1)
// CLCDATA<MLC1OUT>
extern volatile __bit                   MLC1OUT             __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 MLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// CLCDATA<MLC2OUT>
extern volatile __bit                   MLC2OUT             __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 MLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// CLCDATA<MLC3OUT>
extern volatile __bit                   MLC3OUT             __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 MLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// AT1CON0<MODE>
extern volatile __bit                   MODE                __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 MODE_bit            _BIT_ACCESS(AT1CON0,0)
// AT1CON1<MPP>
extern volatile __bit                   MPP                 __at(0x40AA);	// @ (0x815 * 8 + 2)
#define                                 MPP_bit             _BIT_ACCESS(AT1CON1,2)
// SSP1MSK<MSK0>
extern volatile __bit                   MSK0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<MSK1>
extern volatile __bit                   MSK1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<MSK2>
extern volatile __bit                   MSK2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<MSK3>
extern volatile __bit                   MSK3                __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// ODCONA<ODA0>
extern volatile __bit                   ODA0                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODA0_bit            _BIT_ACCESS(ODCONA,0)
// ODCONA<ODA1>
extern volatile __bit                   ODA1                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODA1_bit            _BIT_ACCESS(ODCONA,1)
// ODCONA<ODA2>
extern volatile __bit                   ODA2                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODA2_bit            _BIT_ACCESS(ODCONA,2)
// ODCONA<ODA4>
extern volatile __bit                   ODA4                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODA4_bit            _BIT_ACCESS(ODCONA,4)
// ODCONA<ODA5>
extern volatile __bit                   ODA5                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODA5_bit            _BIT_ACCESS(ODCONA,5)
// ODCONC<ODC0>
extern volatile __bit                   ODC0                __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODC0_bit            _BIT_ACCESS(ODCONC,0)
// ODCONC<ODC1>
extern volatile __bit                   ODC1                __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODC1_bit            _BIT_ACCESS(ODCONC,1)
// ODCONC<ODC2>
extern volatile __bit                   ODC2                __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODC2_bit            _BIT_ACCESS(ODCONC,2)
// ODCONC<ODC3>
extern volatile __bit                   ODC3                __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODC3_bit            _BIT_ACCESS(ODCONC,3)
// ODCONC<ODC4>
extern volatile __bit                   ODC4                __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODC4_bit            _BIT_ACCESS(ODCONC,4)
// ODCONC<ODC5>
extern volatile __bit                   ODC5                __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODC5_bit            _BIT_ACCESS(ODCONC,5)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// PIE2<OSCFIE>
extern volatile __bit                   OSCFIE              __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x8F);	// @ (0x11 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// PID1OUTLL<OUT0>
extern volatile __bit                   OUT0                __at(0x2CB0);	// @ (0x596 * 8 + 0)
#define                                 OUT0_bit            _BIT_ACCESS(PID1OUTLL,0)
// PID1OUTLL<OUT1>
extern volatile __bit                   OUT1                __at(0x2CB1);	// @ (0x596 * 8 + 1)
#define                                 OUT1_bit            _BIT_ACCESS(PID1OUTLL,1)
// PID1OUTLH<OUT10>
extern volatile __bit                   OUT10               __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(PID1OUTLH,2)
// PID1OUTLH<OUT11>
extern volatile __bit                   OUT11               __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(PID1OUTLH,3)
// PID1OUTLH<OUT12>
extern volatile __bit                   OUT12               __at(0x2CBC);	// @ (0x597 * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(PID1OUTLH,4)
// PID1OUTLH<OUT13>
extern volatile __bit                   OUT13               __at(0x2CBD);	// @ (0x597 * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(PID1OUTLH,5)
// PID1OUTLH<OUT14>
extern volatile __bit                   OUT14               __at(0x2CBE);	// @ (0x597 * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(PID1OUTLH,6)
// PID1OUTLH<OUT15>
extern volatile __bit                   OUT15               __at(0x2CBF);	// @ (0x597 * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(PID1OUTLH,7)
// PID1OUTHL<OUT16>
extern volatile __bit                   OUT16               __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(PID1OUTHL,0)
// PID1OUTHL<OUT17>
extern volatile __bit                   OUT17               __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(PID1OUTHL,1)
// PID1OUTHL<OUT18>
extern volatile __bit                   OUT18               __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(PID1OUTHL,2)
// PID1OUTHL<OUT19>
extern volatile __bit                   OUT19               __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(PID1OUTHL,3)
// PID1OUTLL<OUT2>
extern volatile __bit                   OUT2                __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(PID1OUTLL,2)
// PID1OUTHL<OUT20>
extern volatile __bit                   OUT20               __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(PID1OUTHL,4)
// PID1OUTHL<OUT21>
extern volatile __bit                   OUT21               __at(0x2CC5);	// @ (0x598 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(PID1OUTHL,5)
// PID1OUTHL<OUT22>
extern volatile __bit                   OUT22               __at(0x2CC6);	// @ (0x598 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(PID1OUTHL,6)
// PID1OUTHL<OUT23>
extern volatile __bit                   OUT23               __at(0x2CC7);	// @ (0x598 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(PID1OUTHL,7)
// PID1OUTHH<OUT24>
extern volatile __bit                   OUT24               __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(PID1OUTHH,0)
// PID1OUTHH<OUT25>
extern volatile __bit                   OUT25               __at(0x2CC9);	// @ (0x599 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(PID1OUTHH,1)
// PID1OUTHH<OUT26>
extern volatile __bit                   OUT26               __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(PID1OUTHH,2)
// PID1OUTHH<OUT27>
extern volatile __bit                   OUT27               __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(PID1OUTHH,3)
// PID1OUTHH<OUT28>
extern volatile __bit                   OUT28               __at(0x2CCC);	// @ (0x599 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(PID1OUTHH,4)
// PID1OUTHH<OUT29>
extern volatile __bit                   OUT29               __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(PID1OUTHH,5)
// PID1OUTLL<OUT3>
extern volatile __bit                   OUT3                __at(0x2CB3);	// @ (0x596 * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(PID1OUTLL,3)
// PID1OUTHH<OUT30>
extern volatile __bit                   OUT30               __at(0x2CCE);	// @ (0x599 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(PID1OUTHH,6)
// PID1OUTHH<OUT31>
extern volatile __bit                   OUT31               __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(PID1OUTHH,7)
// PID1OUTU<OUT32>
extern volatile __bit                   OUT32               __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 OUT32_bit           _BIT_ACCESS(PID1OUTU,0)
// PID1OUTU<OUT33>
extern volatile __bit                   OUT33               __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 OUT33_bit           _BIT_ACCESS(PID1OUTU,1)
// PID1OUTU<OUT34>
extern volatile __bit                   OUT34               __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 OUT34_bit           _BIT_ACCESS(PID1OUTU,2)
// PID1OUTU<OUT35>
extern volatile __bit                   OUT35               __at(0x2CD3);	// @ (0x59A * 8 + 3)
#define                                 OUT35_bit           _BIT_ACCESS(PID1OUTU,3)
// PID1OUTLL<OUT4>
extern volatile __bit                   OUT4                __at(0x2CB4);	// @ (0x596 * 8 + 4)
#define                                 OUT4_bit            _BIT_ACCESS(PID1OUTLL,4)
// PID1OUTLL<OUT5>
extern volatile __bit                   OUT5                __at(0x2CB5);	// @ (0x596 * 8 + 5)
#define                                 OUT5_bit            _BIT_ACCESS(PID1OUTLL,5)
// PID1OUTLL<OUT6>
extern volatile __bit                   OUT6                __at(0x2CB6);	// @ (0x596 * 8 + 6)
#define                                 OUT6_bit            _BIT_ACCESS(PID1OUTLL,6)
// PID1OUTLL<OUT7>
extern volatile __bit                   OUT7                __at(0x2CB7);	// @ (0x596 * 8 + 7)
#define                                 OUT7_bit            _BIT_ACCESS(PID1OUTLL,7)
// PID1OUTLH<OUT8>
extern volatile __bit                   OUT8                __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 OUT8_bit            _BIT_ACCESS(PID1OUTLH,0)
// PID1OUTLH<OUT9>
extern volatile __bit                   OUT9                __at(0x2CB9);	// @ (0x597 * 8 + 1)
#define                                 OUT9_bit            _BIT_ACCESS(PID1OUTLH,1)
// CWG1OCON0<OVRA>
