MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1615/mcu.h
#define                                 STPT3_bit           _BIT_ACCESS(AT1STPTL,3)
// AT1STPTL<STPT4>
extern volatile __bit                   STPT4               __at(0x40D4);	// @ (0x81A * 8 + 4)
#define                                 STPT4_bit           _BIT_ACCESS(AT1STPTL,4)
// AT1STPTL<STPT5>
extern volatile __bit                   STPT5               __at(0x40D5);	// @ (0x81A * 8 + 5)
#define                                 STPT5_bit           _BIT_ACCESS(AT1STPTL,5)
// AT1STPTL<STPT6>
extern volatile __bit                   STPT6               __at(0x40D6);	// @ (0x81A * 8 + 6)
#define                                 STPT6_bit           _BIT_ACCESS(AT1STPTL,6)
// AT1STPTL<STPT7>
extern volatile __bit                   STPT7               __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 STPT7_bit           _BIT_ACCESS(AT1STPTL,7)
// AT1STPTH<STPT8>
extern volatile __bit                   STPT8               __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 STPT8_bit           _BIT_ACCESS(AT1STPTH,0)
// AT1STPTH<STPT9>
extern volatile __bit                   STPT9               __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 STPT9_bit           _BIT_ACCESS(AT1STPTH,1)
// CWG1OCON0<STRA>
extern volatile __bit                   STRA                __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(CWG1OCON0,0)
// CWG1OCON0<STRB>
extern volatile __bit                   STRB                __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(CWG1OCON0,1)
// CWG1OCON0<STRC>
extern volatile __bit                   STRC                __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(CWG1OCON0,2)
// CWG1OCON0<STRD>
extern volatile __bit                   STRD                __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(CWG1OCON0,3)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x3888);	// @ (0x711 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// TX1STA<SYNC>
extern volatile __bit                   SYNC                __at(0xCF4);	// @ (0x19E * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TX1STA,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0x708A);	// @ (0xE11 * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0x708B);	// @ (0xE11 * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CKIPPS<T0CKIPPS4>
extern volatile __bit                   T0CKIPPS4           __at(0x708C);	// @ (0xE11 * 8 + 4)
#define                                 T0CKIPPS4_bit       _BIT_ACCESS(T0CKIPPS,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CKIPPS<T1CKIPPS0>
extern volatile __bit                   T1CKIPPS0           __at(0x7090);	// @ (0xE12 * 8 + 0)
#define                                 T1CKIPPS0_bit       _BIT_ACCESS(T1CKIPPS,0)
// T1CKIPPS<T1CKIPPS1>
extern volatile __bit                   T1CKIPPS1           __at(0x7091);	// @ (0xE12 * 8 + 1)
#define                                 T1CKIPPS1_bit       _BIT_ACCESS(T1CKIPPS,1)
// T1CKIPPS<T1CKIPPS2>
extern volatile __bit                   T1CKIPPS2           __at(0x7092);	// @ (0xE12 * 8 + 2)
#define                                 T1CKIPPS2_bit       _BIT_ACCESS(T1CKIPPS,2)
// T1CKIPPS<T1CKIPPS3>
extern volatile __bit                   T1CKIPPS3           __at(0x7093);	// @ (0xE12 * 8 + 3)
#define                                 T1CKIPPS3_bit       _BIT_ACCESS(T1CKIPPS,3)
// T1CKIPPS<T1CKIPPS4>
extern volatile __bit                   T1CKIPPS4           __at(0x7094);	// @ (0xE12 * 8 + 4)
#define                                 T1CKIPPS4_bit       _BIT_ACCESS(T1CKIPPS,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GPPS<T1GPPS0>
extern volatile __bit                   T1GPPS0             __at(0x7098);	// @ (0xE13 * 8 + 0)
#define                                 T1GPPS0_bit         _BIT_ACCESS(T1GPPS,0)
// T1GPPS<T1GPPS1>
extern volatile __bit                   T1GPPS1             __at(0x7099);	// @ (0xE13 * 8 + 1)
#define                                 T1GPPS1_bit         _BIT_ACCESS(T1GPPS,1)
// T1GPPS<T1GPPS2>
extern volatile __bit                   T1GPPS2             __at(0x709A);	// @ (0xE13 * 8 + 2)
#define                                 T1GPPS2_bit         _BIT_ACCESS(T1GPPS,2)
// T1GPPS<T1GPPS3>
extern volatile __bit                   T1GPPS3             __at(0x709B);	// @ (0xE13 * 8 + 3)
#define                                 T1GPPS3_bit         _BIT_ACCESS(T1GPPS,3)
// T1GPPS<T1GPPS4>
extern volatile __bit                   T1GPPS4             __at(0x709C);	// @ (0xE13 * 8 + 4)
#define                                 T1GPPS4_bit         _BIT_ACCESS(T1GPPS,4)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0xC8);	// @ (0x19 * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0xC9);	// @ (0x19 * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0xCD);	// @ (0x19 * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0xCA);	// @ (0x19 * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T2CKIPPS<T2CKIPPS0>
extern volatile __bit                   T2CKIPPS0           __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 T2CKIPPS0_bit       _BIT_ACCESS(T2CKIPPS,0)
// T2CKIPPS<T2CKIPPS1>
extern volatile __bit                   T2CKIPPS1           __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 T2CKIPPS1_bit       _BIT_ACCESS(T2CKIPPS,1)
// T2CKIPPS<T2CKIPPS2>
extern volatile __bit                   T2CKIPPS2           __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 T2CKIPPS2_bit       _BIT_ACCESS(T2CKIPPS,2)
// T2CKIPPS<T2CKIPPS3>
extern volatile __bit                   T2CKIPPS3           __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 T2CKIPPS3_bit       _BIT_ACCESS(T2CKIPPS,3)
// T2CKIPPS<T2CKIPPS4>
extern volatile __bit                   T2CKIPPS4           __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 T2CKIPPS4_bit       _BIT_ACCESS(T2CKIPPS,4)
// T2HLT<T2CKPOL>
extern volatile __bit                   T2CKPOL             __at(0xEE);	// @ (0x1D * 8 + 6)
#define                                 T2CKPOL_bit         _BIT_ACCESS(T2HLT,6)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0xE4);	// @ (0x1C * 8 + 4)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,4)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0xE5);	// @ (0x1C * 8 + 5)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,5)
// T2CON<T2CKPS2>
extern volatile __bit                   T2CKPS2             __at(0xE6);	// @ (0x1C * 8 + 6)
#define                                 T2CKPS2_bit         _BIT_ACCESS(T2CON,6)
// T2HLT<T2CKSYNC>
extern volatile __bit                   T2CKSYNC            __at(0xED);	// @ (0x1D * 8 + 5)
#define                                 T2CKSYNC_bit        _BIT_ACCESS(T2HLT,5)
// T2CLKCON<T2CS0>
extern volatile __bit                   T2CS0               __at(0xF0);	// @ (0x1E * 8 + 0)
#define                                 T2CS0_bit           _BIT_ACCESS(T2CLKCON,0)
// T2CLKCON<T2CS1>
extern volatile __bit                   T2CS1               __at(0xF1);	// @ (0x1E * 8 + 1)
#define                                 T2CS1_bit           _BIT_ACCESS(T2CLKCON,1)
// T2CLKCON<T2CS2>
extern volatile __bit                   T2CS2               __at(0xF2);	// @ (0x1E * 8 + 2)
#define                                 T2CS2_bit           _BIT_ACCESS(T2CLKCON,2)
// T2CLKCON<T2CS3>
extern volatile __bit                   T2CS3               __at(0xF3);	// @ (0x1E * 8 + 3)
#define                                 T2CS3_bit           _BIT_ACCESS(T2CLKCON,3)
// T2HLT<T2MODE0>
extern volatile __bit                   T2MODE0             __at(0xE8);	// @ (0x1D * 8 + 0)
#define                                 T2MODE0_bit         _BIT_ACCESS(T2HLT,0)
// T2HLT<T2MODE1>
extern volatile __bit                   T2MODE1             __at(0xE9);	// @ (0x1D * 8 + 1)
#define                                 T2MODE1_bit         _BIT_ACCESS(T2HLT,1)
// T2HLT<T2MODE2>
extern volatile __bit                   T2MODE2             __at(0xEA);	// @ (0x1D * 8 + 2)
#define                                 T2MODE2_bit         _BIT_ACCESS(T2HLT,2)
// T2HLT<T2MODE3>
extern volatile __bit                   T2MODE3             __at(0xEB);	// @ (0x1D * 8 + 3)
#define                                 T2MODE3_bit         _BIT_ACCESS(T2HLT,3)
// T2HLT<T2MODE4>
extern volatile __bit                   T2MODE4             __at(0xEC);	// @ (0x1D * 8 + 4)
#define                                 T2MODE4_bit         _BIT_ACCESS(T2HLT,4)
// T2CON<T2ON>
extern volatile __bit                   T2ON                __at(0xE7);	// @ (0x1C * 8 + 7)
#define                                 T2ON_bit            _BIT_ACCESS(T2CON,7)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,0)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0xE1);	// @ (0x1C * 8 + 1)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0xE2);	// @ (0x1C * 8 + 2)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,2)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 T2OUTPS3_bit        _BIT_ACCESS(T2CON,3)
// T2CKIPPS<T2PPS0>
extern volatile __bit                   T2PPS0              __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 T2PPS0_bit          _BIT_ACCESS(T2CKIPPS,0)
// T2CKIPPS<T2PPS1>
extern volatile __bit                   T2PPS1              __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 T2PPS1_bit          _BIT_ACCESS(T2CKIPPS,1)
// T2CKIPPS<T2PPS2>
extern volatile __bit                   T2PPS2              __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 T2PPS2_bit          _BIT_ACCESS(T2CKIPPS,2)
// T2CKIPPS<T2PPS3>
extern volatile __bit                   T2PPS3              __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 T2PPS3_bit          _BIT_ACCESS(T2CKIPPS,3)
// T2CKIPPS<T2PPS4>
extern volatile __bit                   T2PPS4              __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 T2PPS4_bit          _BIT_ACCESS(T2CKIPPS,4)
// T2HLT<T2PSYNC>
extern volatile __bit                   T2PSYNC             __at(0xEF);	// @ (0x1D * 8 + 7)
#define                                 T2PSYNC_bit         _BIT_ACCESS(T2HLT,7)
// T2RST<T2RSEL0>
extern volatile __bit                   T2RSEL0             __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 T2RSEL0_bit         _BIT_ACCESS(T2RST,0)
// T2RST<T2RSEL1>
extern volatile __bit                   T2RSEL1             __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 T2RSEL1_bit         _BIT_ACCESS(T2RST,1)
// T2RST<T2RSEL2>
extern volatile __bit                   T2RSEL2             __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 T2RSEL2_bit         _BIT_ACCESS(T2RST,2)
// T2RST<T2RSEL3>
extern volatile __bit                   T2RSEL3             __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 T2RSEL3_bit         _BIT_ACCESS(T2RST,3)
// T3CKIPPS<T3CKIPPS0>
extern volatile __bit                   T3CKIPPS0           __at(0x70C8);	// @ (0xE19 * 8 + 0)
#define                                 T3CKIPPS0_bit       _BIT_ACCESS(T3CKIPPS,0)
// T3CKIPPS<T3CKIPPS1>
extern volatile __bit                   T3CKIPPS1           __at(0x70C9);	// @ (0xE19 * 8 + 1)
#define                                 T3CKIPPS1_bit       _BIT_ACCESS(T3CKIPPS,1)
// T3CKIPPS<T3CKIPPS2>
extern volatile __bit                   T3CKIPPS2           __at(0x70CA);	// @ (0xE19 * 8 + 2)
#define                                 T3CKIPPS2_bit       _BIT_ACCESS(T3CKIPPS,2)
// T3CKIPPS<T3CKIPPS3>
extern volatile __bit                   T3CKIPPS3           __at(0x70CB);	// @ (0xE19 * 8 + 3)
#define                                 T3CKIPPS3_bit       _BIT_ACCESS(T3CKIPPS,3)
// T3CKIPPS<T3CKIPPS4>
extern volatile __bit                   T3CKIPPS4           __at(0x70CC);	// @ (0xE19 * 8 + 4)
#define                                 T3CKIPPS4_bit       _BIT_ACCESS(T3CKIPPS,4)
// T3CON<T3CKPS0>
extern volatile __bit                   T3CKPS0             __at(0x24AC);	// @ (0x495 * 8 + 4)
#define                                 T3CKPS0_bit         _BIT_ACCESS(T3CON,4)
// T3CON<T3CKPS1>
extern volatile __bit                   T3CKPS1             __at(0x24AD);	// @ (0x495 * 8 + 5)
#define                                 T3CKPS1_bit         _BIT_ACCESS(T3CON,5)
// T3GCON<T3GGO_nDONE>
extern volatile __bit                   T3GGO_nDONE         __at(0x24B3);	// @ (0x496 * 8 + 3)
#define                                 T3GGO_nDONE_bit     _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GPOL>
extern volatile __bit                   T3GPOL              __at(0x24B6);	// @ (0x496 * 8 + 6)
#define                                 T3GPOL_bit          _BIT_ACCESS(T3GCON,6)
// T3GPPS<T3GPPS0>
extern volatile __bit                   T3GPPS0             __at(0x70D0);	// @ (0xE1A * 8 + 0)
#define                                 T3GPPS0_bit         _BIT_ACCESS(T3GPPS,0)
// T3GPPS<T3GPPS1>
extern volatile __bit                   T3GPPS1             __at(0x70D1);	// @ (0xE1A * 8 + 1)
#define                                 T3GPPS1_bit         _BIT_ACCESS(T3GPPS,1)
// T3GPPS<T3GPPS2>
extern volatile __bit                   T3GPPS2             __at(0x70D2);	// @ (0xE1A * 8 + 2)
#define                                 T3GPPS2_bit         _BIT_ACCESS(T3GPPS,2)
// T3GPPS<T3GPPS3>
extern volatile __bit                   T3GPPS3             __at(0x70D3);	// @ (0xE1A * 8 + 3)
#define                                 T3GPPS3_bit         _BIT_ACCESS(T3GPPS,3)
// T3GPPS<T3GPPS4>
extern volatile __bit                   T3GPPS4             __at(0x70D4);	// @ (0xE1A * 8 + 4)
#define                                 T3GPPS4_bit         _BIT_ACCESS(T3GPPS,4)
// T3GCON<T3GSPM>
extern volatile __bit                   T3GSPM              __at(0x24B4);	// @ (0x496 * 8 + 4)
#define                                 T3GSPM_bit          _BIT_ACCESS(T3GCON,4)
// T3GCON<T3GSS0>
extern volatile __bit                   T3GSS0              __at(0x24B0);	// @ (0x496 * 8 + 0)
#define                                 T3GSS0_bit          _BIT_ACCESS(T3GCON,0)
// T3GCON<T3GSS1>
extern volatile __bit                   T3GSS1              __at(0x24B1);	// @ (0x496 * 8 + 1)
#define                                 T3GSS1_bit          _BIT_ACCESS(T3GCON,1)
// T3GCON<T3GTM>
extern volatile __bit                   T3GTM               __at(0x24B5);	// @ (0x496 * 8 + 5)
#define                                 T3GTM_bit           _BIT_ACCESS(T3GCON,5)
// T3GCON<T3GVAL>
extern volatile __bit                   T3GVAL              __at(0x24B2);	// @ (0x496 * 8 + 2)
#define                                 T3GVAL_bit          _BIT_ACCESS(T3GCON,2)
// T3CON<T3SYNC>
extern volatile __bit                   T3SYNC              __at(0x24AA);	// @ (0x495 * 8 + 2)
#define                                 T3SYNC_bit          _BIT_ACCESS(T3CON,2)
// T4CKIPPS<T4CKIPPS0>
extern volatile __bit                   T4CKIPPS0           __at(0x70D8);	// @ (0xE1B * 8 + 0)
#define                                 T4CKIPPS0_bit       _BIT_ACCESS(T4CKIPPS,0)
// T4CKIPPS<T4CKIPPS1>
extern volatile __bit                   T4CKIPPS1           __at(0x70D9);	// @ (0xE1B * 8 + 1)
#define                                 T4CKIPPS1_bit       _BIT_ACCESS(T4CKIPPS,1)
// T4CKIPPS<T4CKIPPS2>
extern volatile __bit                   T4CKIPPS2           __at(0x70DA);	// @ (0xE1B * 8 + 2)
#define                                 T4CKIPPS2_bit       _BIT_ACCESS(T4CKIPPS,2)
// T4CKIPPS<T4CKIPPS3>
extern volatile __bit                   T4CKIPPS3           __at(0x70DB);	// @ (0xE1B * 8 + 3)
#define                                 T4CKIPPS3_bit       _BIT_ACCESS(T4CKIPPS,3)
// T4CKIPPS<T4CKIPPS4>
extern volatile __bit                   T4CKIPPS4           __at(0x70DC);	// @ (0xE1B * 8 + 4)
#define                                 T4CKIPPS4_bit       _BIT_ACCESS(T4CKIPPS,4)
// T4HLT<T4CKPOL>
extern volatile __bit                   T4CKPOL             __at(0x20B6);	// @ (0x416 * 8 + 6)
#define                                 T4CKPOL_bit         _BIT_ACCESS(T4HLT,6)
// T4CON<T4CKPS0>
extern volatile __bit                   T4CKPS0             __at(0x20AC);	// @ (0x415 * 8 + 4)
#define                                 T4CKPS0_bit         _BIT_ACCESS(T4CON,4)
// T4CON<T4CKPS1>
extern volatile __bit                   T4CKPS1             __at(0x20AD);	// @ (0x415 * 8 + 5)
#define                                 T4CKPS1_bit         _BIT_ACCESS(T4CON,5)
// T4CON<T4CKPS2>
extern volatile __bit                   T4CKPS2             __at(0x20AE);	// @ (0x415 * 8 + 6)
#define                                 T4CKPS2_bit         _BIT_ACCESS(T4CON,6)
// T4HLT<T4CKSYNC>
extern volatile __bit                   T4CKSYNC            __at(0x20B5);	// @ (0x416 * 8 + 5)
#define                                 T4CKSYNC_bit        _BIT_ACCESS(T4HLT,5)
// T4CLKCON<T4CS0>
extern volatile __bit                   T4CS0               __at(0x20B8);	// @ (0x417 * 8 + 0)
#define                                 T4CS0_bit           _BIT_ACCESS(T4CLKCON,0)
// T4CLKCON<T4CS1>
extern volatile __bit                   T4CS1               __at(0x20B9);	// @ (0x417 * 8 + 1)
#define                                 T4CS1_bit           _BIT_ACCESS(T4CLKCON,1)
// T4CLKCON<T4CS2>
extern volatile __bit                   T4CS2               __at(0x20BA);	// @ (0x417 * 8 + 2)
#define                                 T4CS2_bit           _BIT_ACCESS(T4CLKCON,2)
// T4CLKCON<T4CS3>
extern volatile __bit                   T4CS3               __at(0x20BB);	// @ (0x417 * 8 + 3)
#define                                 T4CS3_bit           _BIT_ACCESS(T4CLKCON,3)
// T4HLT<T4MODE0>
extern volatile __bit                   T4MODE0             __at(0x20B0);	// @ (0x416 * 8 + 0)
#define                                 T4MODE0_bit         _BIT_ACCESS(T4HLT,0)
// T4HLT<T4MODE1>
extern volatile __bit                   T4MODE1             __at(0x20B1);	// @ (0x416 * 8 + 1)
#define                                 T4MODE1_bit         _BIT_ACCESS(T4HLT,1)
// T4HLT<T4MODE2>
extern volatile __bit                   T4MODE2             __at(0x20B2);	// @ (0x416 * 8 + 2)
#define                                 T4MODE2_bit         _BIT_ACCESS(T4HLT,2)
// T4HLT<T4MODE3>
extern volatile __bit                   T4MODE3             __at(0x20B3);	// @ (0x416 * 8 + 3)
#define                                 T4MODE3_bit         _BIT_ACCESS(T4HLT,3)
// T4HLT<T4MODE4>
extern volatile __bit                   T4MODE4             __at(0x20B4);	// @ (0x416 * 8 + 4)
#define                                 T4MODE4_bit         _BIT_ACCESS(T4HLT,4)
// T4CON<T4ON>
extern volatile __bit                   T4ON                __at(0x20AF);	// @ (0x415 * 8 + 7)
#define                                 T4ON_bit            _BIT_ACCESS(T4CON,7)
// T4CON<T4OUTPS0>
extern volatile __bit                   T4OUTPS0            __at(0x20A8);	// @ (0x415 * 8 + 0)
#define                                 T4OUTPS0_bit        _BIT_ACCESS(T4CON,0)
// T4CON<T4OUTPS1>
extern volatile __bit                   T4OUTPS1            __at(0x20A9);	// @ (0x415 * 8 + 1)
#define                                 T4OUTPS1_bit        _BIT_ACCESS(T4CON,1)
// T4CON<T4OUTPS2>
extern volatile __bit                   T4OUTPS2            __at(0x20AA);	// @ (0x415 * 8 + 2)
#define                                 T4OUTPS2_bit        _BIT_ACCESS(T4CON,2)
// T4CON<T4OUTPS3>
extern volatile __bit                   T4OUTPS3            __at(0x20AB);	// @ (0x415 * 8 + 3)
#define                                 T4OUTPS3_bit        _BIT_ACCESS(T4CON,3)
// T4CKIPPS<T4PPS0>
extern volatile __bit                   T4PPS0              __at(0x70D8);	// @ (0xE1B * 8 + 0)
#define                                 T4PPS0_bit          _BIT_ACCESS(T4CKIPPS,0)
// T4CKIPPS<T4PPS1>
extern volatile __bit                   T4PPS1              __at(0x70D9);	// @ (0xE1B * 8 + 1)
#define                                 T4PPS1_bit          _BIT_ACCESS(T4CKIPPS,1)
// T4CKIPPS<T4PPS2>
extern volatile __bit                   T4PPS2              __at(0x70DA);	// @ (0xE1B * 8 + 2)
#define                                 T4PPS2_bit          _BIT_ACCESS(T4CKIPPS,2)
// T4CKIPPS<T4PPS3>
extern volatile __bit                   T4PPS3              __at(0x70DB);	// @ (0xE1B * 8 + 3)
